# -*- coding: utf-8 -*-
'''
Created on Apr 28, 2014

@author: Jake
Generate noun forms based on a given morphological code and root.
'''

#Generate Noun forms as:
#   [ns: form,
#    gs: form,
#    ds: form,
#    cs: form,  #Accusative
#    vs: form,
#    np: form,
#    gp: form,
#    dp: form,
#    cp: form]  #Accusative    
def generateNounForms(noun, style):
    '''Generates the forms of a noun based on a certain morphological
    code. A value of 0 in any position means the word cannot be found
    in that form. The forms are returned as:
        [ns,gs,ds,cs,vs,
         np,gp,dp,cp]
    
    Keyword arguments:
    noun -- The root of the noun (masculine singular)
    style -- Style code of the noun. Different codes form
             differently. Drawn from Mounce's "Morphology of
             Biblical Greek"
    '''
    # Match the style and call the correct function
    styles = {'n1a':n1a,
              'n1b':n1b,
              'n1c':n1c,
              'n1d':n1d,
              'n1e':n1e,
              'n1f':n1f,
              'n1g':n1g,
              'n1h':n1h,
              'n2a':n2a,
              'n2b':n2b,
              'n2c':n2c,
              'n2d':n2d,
              'n2e':n2e,
              'n3a':n3a,
              'n3b':n3b,
              'n3c':n3c,
              'n3d':n3d,
              'n3e':n3e,
              'n3f':n3f,
              'n3g':n3g}
    return styles[style](noun)

def n1a(noun):
    '''n1a - Feminine nouns with stems ending in εα, ια, ρα, and a
    genitive in ας (First Declension)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    return [noun,
     noun+'ς',
     noun[:-2]+'ᾳ',
     noun+'ν',
     noun,
     noun+'ι',
     noun[:-2]+'ῶν',
     noun+'ις',
     noun+'ς']

def n1b(noun):
    '''n1b - Feminine nouns with stems ending in η and a genitive in
    ης (First Declension)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    return [noun,
     noun+'ς',
     noun[:-2]+'ῃ',
     noun+'ν',
     noun,
     noun[:-2]+'αί',
     noun[:-2]+'ῶν',
     noun[:-2]+'αῖς',
     noun[:-2]+'άς']

def n1c(noun):
    '''n1c - Feminine nouns with stems ending in α (without a
    preceding ε,ι,or ρ) and a genitive in ης (First Declension)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    return [noun,
     noun[:-2]+'ης',
     noun[:-2]+'ῃ',
     noun+'ν',
     noun,
     noun[:-2]+'ι',
     noun+'ῶν',
     noun+'ις',
     noun+'ς']

def n1d(noun):
    '''n1d - Masculine nouns with stems ending in α(ς) and a genitive
    in ου (First Declension)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    return [noun,
     noun[:-4]+'ου',
     noun[:-4]+'ᾳ',
     noun[:-2]+'ν',
     noun[:-2],
     noun[:-2]+'ι',
     noun[:-4]+'ῶν',
     noun[:-2]+'ις',
     noun]

def n1e(noun):
    '''n1e - Masculine nouns with stems ending in α(ς) and a genitive
    in α (First Declension)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    if noun == 'βορρᾶς':
        return [0,
         noun[:-2],
         0,
         0,
         0,
         0,
         0,
         0,
         0]
    elif noun.endswith('ᾶς'):
        return [noun,
         noun[:-2],
         noun[:-5]+'ᾳ',
         noun[:-2]+'ν',
         noun,
         0,
         0,
         0,
         0]
    else:
        return [noun,
         noun[:-2],
         noun[:-4]+'ᾳ',
         noun[:-2]+'ν',
         noun,
         0,
         0,
         0,
         0]

def n1f(noun):
    '''n1f - Masculine nouns with stems ending in η(ς) and a genitive
    in ου (First Declension)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    return [noun,
     noun[:-4]+'ου',
     noun[:-4]+'ῃ',
     noun[:-2]+'ν',
     noun[:-4]+'α' if noun[-6:].startswith('τ') else noun[:-2],
     noun[:-4]+'αι',
     noun[:-4]+'ῶν',
     noun[:-4]+'αις',
     noun[:-4]+'ας']

def n1g(noun):
    '''n1g - Masculine nouns with stems ending in η(ς) and a genitive
    in η (First Declension)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    return [noun,
     noun[:-2],
     noun[:-2]+'ῃ',
     noun[:-2],
     noun[:-2],
     0,
     0,
     0,
     0]

def n1h(noun):
    '''n1h - First declension contract nouns
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    if noun.endswith('ῆς'):
        return [noun[:-2],
         noun,
         noun[:-5]+'ῇ',
         noun[:-2]+'ς',
         noun[:-2],
         noun[:-5]+'αῖ',
         noun[:-5]+'ῶν',
         noun[:-5]+'αῖς',
         noun[:-5]+'ᾶς']
    elif noun.endswith('ῆ'):
        return [noun,
         noun[:-3]+'ου',
         noun[:-3]+'ῃ',
         noun[:-3]+'ν',
         noun,
         noun[:-3]+'αι',
         noun[:-3]+'ῶν',
         noun[:-3]+'αις',
         noun[:-3]+'ας']
    else:       
        return [noun,
         noun+'ς',
         noun[:-3]+'ᾳ',
         noun+'ν',
         noun,
         noun+'ῖ',
         noun[:-3]+'ῶν',
         noun[:-3]+'αῖς',
         noun+'ς']

def n2a(noun):
    '''n2a - Masculine nouns with stems ending in ο(ς) (Second
    Declension)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    return [noun,
     noun[:-2]+'υ',
     noun[:-4]+'ῳ',
     noun[:-2]+'ν',
     noun[:-4]+'ε',
     noun[:-2]+'ι',
     noun[:-4]+'ων',
     noun[:-2]+'ις',
     noun[:-2]+'υς']

def n2b(noun):
    '''n2b - Feminine nouns with stems ending in ο(ς) (Second
    Declension)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    return [noun,
     noun[:-2]+'υ',
     noun[:-4]+'ῳ',
     noun[:-2]+'ν',
     noun[:-4]+'ε',
     noun[:-2]+'ι',
     noun[:-4]+'ων',
     noun[:-2]+'ις',
     noun[:-2]+'υς']

def n2c(noun):
    '''n2c - Neuter nouns with stems ending in ο(ν) (Second
    Declension)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    return [noun,
     noun[:-2]+'υ',
     noun[:-4]+'ῳ',
     noun,
     noun,
     noun[:-4]+'α',
     noun[:-4]+'ων',
     noun[:-2]+'ις',
     noun[:-4]+'α']

def n2d(noun):
    '''n2d - Second declension contract nouns with stems ending in εο
    or οο.
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    if noun.endswith('ους'):
        return [noun,
         noun[:-2],
         noun[:-6]+'ῳ',
         noun[:-2]+'ν',
         noun,
         noun[:-4]+'ι',
         noun[:-6]+'ων',
         noun[:-4]+'ις',
         noun]
    else:
        return [noun,
         noun[:-2],
         noun[:-7]+'ῳ',
         noun[:-7]+'α',
         noun,
         noun[:-7]+'α',
         noun[:-7]+'ων',
         noun[:-5]+'ις',
         noun[:-7]+'α']

#not in plural
def n2e(noun):
    '''n2e - Nouns with stems ending in εω(ς) ("Attic" declension)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    if noun.endswith('λῶς'):
        return [noun,
         noun[:-2],
         0,
         noun[:-2]+'ν',
         noun,
         0,
         0,
         0,
         0]
    else:
        return [noun,
         noun[:-2],
         noun[:-4]+'ῳ',
         noun[:-2],
         noun,
         0,
         0,
         0,
         0]

def n3a(noun):
    '''n3a - Stems ending in a labial (third declinsion)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    if noun.endswith('ωψ') or noun.endswith('αψ') or noun.endswith('οψ'):
        return [noun,
         noun[:-2]+'πος',
         noun[:-2]+'πι',
         noun[:-2]+'πα',
         noun,
         noun[:-2]+'πες',
         noun[:-2]+'πων',
         noun+'ιν',
         noun[:-2]+'πας']
    else:
        return [noun,
         noun[:-2]+'βος',
         noun[:-2]+'βι',
         noun[:-2]+'βα',
         noun,
         noun[:-2]+'βες',
         noun[:-2]+'βων',
         noun+'ιν',
         noun[:-2]+'βας']

def n3b(noun):
    '''n3b - Stems ending in a velar (third declinsion)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    if noun.endswith('νθξ') or noun.endswith('ίξ'):
        return [noun,
         noun[:-2]+'χος',
         noun[:-2]+'χι',
         noun[:-2]+'χα',
         noun,
         noun[:-2]+'χες',
         noun[:-2]+'χων',
         noun+'ιν',
         noun[:-2]+'χας']
    elif noun.endswith('ἴξ') or noun.endswith('γξ') or noun.endswith('παξ') or noun.endswith('όξ') or noun.endswith('τιξ') or noun.endswith('υξ'):
        return [noun,
         noun[:-2]+'γος',
         noun[:-2]+'γι',
         noun[:-2]+'γα',
         noun,
         noun[:-2]+'γες',
         noun[:-2]+'γων',
         noun+'ιν',
         noun[:-2]+'γας']
    elif noun.endswith('ή'):
        return [noun,
         noun[:-2]+'αικος',
         noun[:-2]+'αικι',
         noun[:-2]+'αικα',
         noun,
         noun[:-2]+'αικες',
         noun[:-2]+'αικων',
         noun[:-2]+'αιξιν',
         noun[:-2]+'αικας']
    else:
        return [noun,
         noun[:-2]+'κος',
         noun[:-2]+'κι',
         noun[:-2]+'κα',
         noun,
         noun[:-2]+'κες',
         noun[:-2]+'κων',
         noun+'ιν',
         noun[:-2]+'κας']

def n3c(noun):
    '''n3a - Stems ending in a dental (third declinsion)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    if noun in ['ἅλας','κέρας','πέρας','τέρας']:
        return [noun,
         noun[:-2]+'τος',
         noun[:-2]+'τι',
         noun[:-2]+'τα',
         noun,
         noun[:-2]+'τες',
         noun[:-2]+'των',
         noun+'ιν',
         noun[:-2]+'τας']
    elif noun in ['ὕδωρ','ὄvap','φρέαρ']:
        return [noun,
         noun[:-4]+'ατος',
         noun[:-4]+'ατι',
         noun[:-4]+'ατα',
         noun,
         noun[:-4]+'ατα',
         noun[:-4]+'ατων',
         noun+'ασιν',
         noun[:-4]+'ατα']
    elif noun == 'φῶς':
        return [noun,
         noun[:-2]+'τος',
         noun[:-2]+'τι',
         noun[:-2]+'τα',
         noun,
         noun[:-2]+'τα',
         noun[:-2]+'των',
         0,
         noun[:-2]+'τα']
    elif noun == 'οὖς':
        return [noun,
         noun[:-2]+'ὠτός',
         noun[:-2]+'ὠτί',
         noun,
         noun,
         noun[:-2]+'ὦτα',
         noun[:-2]+'ὤτων',
         noun+'ὠσιν',
         noun[:-2]+'ὦτα']
    elif noun == 'γάλα':
        return [noun,
         noun+'κτος',
         0,
         noun,
         noun,
         0,
         0,
         0,
         0]
    elif noun == 'γόνυ':
        return [noun,
         noun[:-2]+'ατος',
         0,
         noun,
         noun,
         noun[:-2]+'ατα',
         0,
         noun[:-2]+'ασιν',
         noun[:-2]+'ατα']
    elif noun == 'μέλι':
        return [noun,
         noun+'τος',
         0,
         noun,
         noun,
         0,
         0,
         0,
         0]
    elif noun == 'κρέας':
        return [noun,
         noun[:-2]+'ως',
         0,
         noun,
         noun,
         noun[:-2],
         0,
         0,
         noun[:-2]]
    elif noun in ['ἱμάς','Κρήσκης','Πούδης','Κλήμης','ὀδούς']:
        if noun.endswith('ης'):
            return [noun,
             noun[:-4]+'εντος',
             noun[:-4]+'εντι',
             noun[:-4]+'εντα',
             noun,
             noun[:-4]+'εντες',
             noun[:-4]+'εντων',
             noun[:-2]+'σιν',
             noun[:-4]+'εντας']
        elif noun.endswith('άς'):
            return [noun,
             noun[:-2]+'ντος',
             noun[:-2]+'ντι',
             noun[:-2]+'ντα',
             noun,
             noun[:-2]+'ντες',
             noun[:-2]+'ντων',
             noun[:-2]+'σιν',
             noun[:-2]+'ντας']
        else:
            return [noun,
             noun[:-4]+'οντος',
             noun[:-4]+'οντι',
             noun[:-4]+'οντα',
             noun,
             noun[:-4]+'οντες',
             noun[:-4]+'οντων',
             noun[:-2]+'σιν',
             noun[:-4]+'οντας']
    elif noun.endswith('ων') or noun.endswith('ών'):
        return [noun,
         noun[:-4]+'οντος',
         noun[:-4]+'οντι',
         noun[:-4]+'οντα',
         noun,
         noun[:-4]+'οντες',
         noun[:-4]+'οντων',
         noun[:-4]+'ουσιν',
         noun[:-4]+'οντας']
    elif noun.endswith('μα'):
        return [noun,
         noun+'τος',
         noun+'τι',
         noun,
         noun,
         noun+'τα',
         noun+'των',
         noun+'σιν',
         noun+'τα']
    elif noun.endswith('νις'):
        return [noun,
         noun[:-2]+'θος',
         noun[:-2]+'θι',
         noun[:-2]+'θα',
         noun[:-2],
         noun[:-2]+'θες',
         noun[:-2]+'θων',
         noun[:-2]+'σιν',
         noun[:-2]+'θας']
    elif noun.endswith('άρις') or noun.endswith('ξ') or noun.endswith('ης') or noun.endswith('ής') or noun.endswith('ως'):
        return [noun,
         noun[:-2]+'πος',
         noun[:-2]+'πι',
         noun[:-2]+'πα',
         noun[:-2],
         noun[:-2]+'πες',
         noun[:-2]+'πων',
         noun[:-2]+'σιν',
         noun[:-2]+'πας']
    else:
        return [noun,
         noun[:-2]+'τος',
         noun[:-2]+'τι',
         noun[:-2]+'τα',
         noun[:-2],
         noun[:-2]+'τες',
         noun[:-2]+'των',
         noun[:-2]+'σιν',
         noun[:-2]+'τας']
    
def n3d(noun):
    '''n3d - Stems ending in ς (third declinsion)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    if noun.endswith('ας'):
        return [noun,
         noun[:-4]+'ους',
         noun[:-4]+'ει',
         noun,
         noun,
         0,
         0,
         0,
         0]
    if noun.endswith('ης'):
        return [noun,
         noun[:-4]+'ους',
         noun[:-4]+'ει',
         noun[:-2]+'ν',
         noun,
         0,
         0,
         0,
         0]
    elif noun.endswith('ώς'):
        return [noun,
         noun[:-4]+'ους',
         noun[:-4]+'οι',
         noun[:-2],
         noun,
         0,
         0,
         0,
         0]
    else:
        return [noun,
         noun[:-2]+'υς',
         noun[:-4]+'ει',
         noun,
         noun,
         noun[:-4]+'η',
         noun[:-4]+'ων',
         noun[:-4]+'εσιν',
         noun[:-4]+'η']
        
def n3e(noun):
    '''n3e - Stems ending in a semi-vowel (third declinsion)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    if noun.endswith('αῦς'):
        return [noun,
         noun[:-7]+'εως',
         noun[:-7]+'ηι',
         noun[:-2]+'ν',
         noun[:-2],
         noun[:-7]+'ηες',
         noun[:-7]+'εων',
         noun[:-2]+'σιν',
         noun]
    elif noun.endswith('εύς'):
        return [noun,
         noun[:-4]+'ως',
         noun[:-4]+'ι',
         noun[:-4]+'αν',
         noun[:-2],
         noun[:-4]+'ις',
         noun[:-4]+'ων',
         noun[:-2]+'σιν',
         noun[:-4]+'ις']
    elif noun.endswith('οῦς'):
        return [noun,
         noun[:-5]+'ος',
         noun[:-5]+'ι',
         noun[:-2]+'ν',
         noun[:-2],
         noun[:-5]+'ες',
         noun[:-5]+'ων',
         noun[:-2]+'σιν',
         noun[:-5]+'ας']
    elif noun.endswith('τις'):
        return [noun,
         0,
         0,
         0,
         0,
         0,
         0,
         0,
         noun[:-4]+'εις']
    elif noun.endswith('ις'):
        return [noun,
         noun[:-4]+'εως',
         noun[:-4]+'ει',
         noun[:-2]+'ν',
         noun[:-2],
         noun[:-4]+'εις',
         noun[:-4]+'εων',
         noun[:-4]+'εσιν',
         noun[:-4]+'εις']
    elif noun.endswith('ι'):
        return [noun,
         noun[:-2]+'εως',
         noun[:-2]+'ει',
         noun+'ν',
         noun,
         noun[:-2]+'εις',
         noun[:-2]+'εων',
         noun[:-2]+'εσιν',
         noun[:-2]+'εις']
    elif noun.endswith('ώ'):
        return [noun,
         noun[:-2]+'ους',
         noun[:-2]+'οι',
         noun,
         noun[:-2]+'οι',
         0,
         0,
         0,
         0]
    else:
        return [noun,
         noun[:-2]+'oς',
         noun[:-2]+'ι',
         noun[:-2]+'ν',
         noun[:-2],
         noun[:-2]+'ες',
         noun[:-2]+'ων',
         noun[:-2]+'σιν',
         noun[:-2]+'αυ']

def n3f(noun):
    '''n3a - Stems showing different degrees of ablaut (nasal and
    liquid) (third declinsion)
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    if noun in ['ἀλαζών','Ἀπολλῦων','ἀρχιποίμην','ἀρχιτέκτων','βραχίων','γείτων','δαίμων','εἰκών','ἡγεμών','Ἰσάων','κανών','λιμήν','Μακεδών','ποιμήν','σιαγών','σινδών','τέκτων','τρυγών','Φιλήμων','φπήν','χαλκηδών','χιών']:
        if noun.endswith('ών') or noun.endswith('ων'):
            return [noun,
             noun[:-4]+'ενος',
             noun[:-4]+'ενι',
             noun[:-4]+'ενα',
             noun,
             noun[:-4]+'ενες',
             noun[:-4]+'ενων',
             noun[:-4]+'εσιν',
             noun[:-4]+'ενας']
        else:
            return [noun,
             noun[:-4]+'ονος',
             noun[:-4]+'ονι',
             noun[:-4]+'ονα',
             noun,
             noun[:-4]+'ονες',
             noun[:-4]+'ονων',
             noun[:-4]+'οσιν',
             noun[:-4]+'ονας']
    elif noun in ['ἀρήν','ἀρνός','κυων']:
        return [noun,
         noun[:-4]+'νος',
         noun[:-4]+'νι',
         noun[:-4]+'να',
         noun,
         noun[:-4]+'νες',
         noun[:-4]+'νων',
         noun[:-4]+'σιν',
         noun[:-4]+'νας']
    elif noun in ['ἀνήρ','γαστήρ','θυγάτηρ','μήτηρ','πατήρ']:
        return [noun,
         noun+'ος',
         noun+'ι',
         noun+'α',
         noun[:-4]+'ερ',
         noun+'ες',
         noun+'ων',
         noun+'σιν',
         noun+'ας']
    elif noun in ['πῦρ']:
        return [noun,
         noun+'ος',
         noun+'ι',
         noun+'α',
         noun[:-5]+'ερ',
         noun+'ες',
         noun+'ων',
         noun+'σιν',
         noun+'ας']
    elif noun.endswith('ήρ'):
        return [noun,
         noun+'ος',
         noun+'ι',
         noun+'α',
         noun[:-4]+'ερ',
         noun+'ες',
         noun+'ων',
         noun+'σιν',
         noun+'ας']
    elif noun.endswith('ωρ'):
        return [noun,
         noun+'ος',
         noun+'ι',
         noun+'α',
         noun[:-4]+'ερ',
         noun+'ες',
         noun+'ων',
         noun+'σιν',
         noun+'ας']
    elif noun.endswith('λς'):
        return [noun,
         noun[:-2]+'ος',
         noun[:-2]+'ι',
         noun[:-2]+'α',
         noun,
         noun[:-2]+'ες',
         noun[:-2]+'ων',
         noun[:-2]+'σιν',
         noun[:-2]+'ας']
    elif noun.endswith('υς'):
        return [noun,
         noun[:-2]+'ρος',
         noun[:-2]+'ρι',
         noun[:-2]+'ρα',
         noun,
         noun[:-2]+'ρες',
         noun[:-2]+'ρων',
         noun[:-2]+'ρσιν',
         noun[:-2]+'ρας']
    elif noun.endswith('ρ'):
        return [noun,
         noun+'ος',
         noun+'ι',
         noun+'α',
         noun[:-4]+'ερ',
         noun+'ες',
         noun+'ων',
         noun+'σιν',
         noun+'ας']
    else:
        return [noun,
         noun+'ος',
         noun+'ι',
         noun+'α',
         noun,
         noun+'ες',
         noun+'ων',
         noun+'σιν',
         noun+'ας']

def n3g(noun):
    '''n3a - Irregularly declined and indeclinable stems
    
    Keyword arguments:
    noun -- Nominative singular root of the noun
    '''
    if noun == 'Ἀκύλας':
        return [noun,
         noun,
         noun,
         noun[:-2]+'ν',
         noun,
         noun,
         noun,
         noun,
         noun]
    elif noun == 'Γολγοθᾶ':
        return [noun,
         noun,
         noun,
         noun+'ν',
         noun,
         noun,
         noun,
         noun,
         noun]
    elif noun == 'Ζηνάς':
        return [noun,
         noun,
         noun,
         noun[:-2]+'ν',
         noun,
         noun,
         noun,
         noun,
         noun]
    elif noun == 'Ζεύς':
        return [noun,
         noun,
         noun,
         noun[:-2],
         noun,
         noun,
         noun,
         noun,
         noun]
    elif noun == 'Θυάτειρα':
        return [noun,
         noun,
         noun,
         noun+'ν',
         noun,
         noun,
         noun,
         noun,
         noun]
    elif noun == 'Θυάτιρα':
        return [noun,
         noun,
         noun,
         noun+'ν',
         noun,
         noun,
         noun,
         noun,
         noun]
    elif noun == 'Ἰησοῦς':
        return [noun,
         noun[:-2],
         noun[:-2],
         noun[:-2]+'ν',
         noun[:-2],
         noun,
         noun,
         noun,
         noun]
    elif noun == 'Λευίς':
        return [noun,
         noun[:-2],
         noun[:-2],
         noun[:-2]+'ν',
         noun,
         noun,
         noun,
         noun,
         noun]
    elif noun == 'Λύδδα':
        return [noun,
         noun,
         noun,
         noun,
         noun[:-2],
         noun,
         noun,
         noun,
         noun]
    elif noun == 'Λύστρα':
        return [noun,
         noun,
         noun,
         noun+'ν',
         noun,
         noun,
         noun,
         noun,
         noun]
    elif noun == 'Μωσῆς':
        return [noun,
         noun[:-4]+'εως',
         noun[:-4]+'ει',
         noun[:-4]+'ην',
         noun,
         noun,
         noun,
         noun,
         noun]
    elif noun == 'Μωϋσῆς':
        return [noun,
         noun[:-5]+'εως',
         noun[:-5]+'ει',
         noun[:-5]+'ην',
         noun,
         noun,
         noun,
         noun,
         noun]
    else:
        return [noun,
         noun,
         noun,
         noun,
         noun,
         noun,
         noun,
         noun,
         noun]

# s=''
# for word in [['κόσμος','n2a'],['αἰών','n3f'],['κτίσις','n3e'],['οὐρανός','n2a'],['ἀήρ','n3f'],['μεσουράνημα','n3c'],['ὕψος','n3d'],['ὕψωμα','n3c'],['παράδεισος','n2a'],['δόξα','n1c'],['βάθος','n3d'],['ᾅδης','n1f'],['ἄβυσσος','n2b'],['γέεννα','n1c'],['φωστήρ','n3f'],['ἥλιος','n2a'],['σελήνη','n1b'],['ἀστήρ','n3f'],['ἄστρον','n2c'],['νεφέλη','n1b'],['ὁμίχλη','n1b'],['ἀτμίς','n3c'],['καπνός','n2a'],['ἶρις','n3c'],['γῆ','n1h'],['οἰκουμένη','n1b'],['κόσμος','n2a'],['ἔδαφος','n3d'],['ὄρος','n3d'],['βουνός','n2a'],['ὀφρῦς','n3e'],['κρημνός','n2a'],['φάραγξ','n3b'],['χείμαρρος','n2a'],['χειμάρρους','n2d'],['ὀπή','n1b'],['χάσμα','n3c'],['βόθυνος','n2a'],['φωλεός','n2a'],['σπήλαιον','n2c'],['φρέαρ','n3c'],['σιρός','n2a'],['σειρός','n2a'],['γῆ','n1h'],['χώρα','n1a'],['χεῖλος','n3d'],['αἰγιαλός','n2a'],['ἄμμος','n2b'],['νῆσος','n2b'],['νησίον','n2c'],['θάλασσα','n1c'],['λίμνη','n1b'],['πέλαγος','n3d'],['πόντος','n2a'],['βυθός','n2a'],['κόλπος','n2a'],['λιμήν','n3f'],['χείμαρρος','n2a'],['χειμάρρους','n2d'],['πηγή','n1b'],['ποταμός','n2a'],['γῆ','n1h'],['χώρα','n1a'],['κλίμα','n3c'],['ὅριον','n2c'],['πατρίς','n3c'],['βασιλεία','n1a'],['οἰκουμένη','n1b'],['ἐπαρχεία','n1a'],['μερίς','n3c'],['ἐρημία','n1a'],['χώρα','n1a'],['ἀγρός','n2a'],['πόλις','n3e'],['κολωνία','n1a'],['κωμόπολις','n3e'],['κώμη','n1b'],['ἀγρός','n2a'],['παρεμβολή','n1b'],['χώρα','n1a'],['χωρίον','n2c'],['ἀγρός','n2a'],['γεώργιον','n2c'],['κῆπος','n2a'],['νομή','n1b'],['ὁδός','n2b'],['τρίβος','n2b'],['ἄμφοδον','n2c'],['διέξοδος','n2b'],['πλατεῖα','n1a'],['ῥύμη','n1b'],['φραγμός','n2a'],['ἀήρ','n3f'],['πῦρ','n3f'],['φλόξ','n3b'],['πυρά','n1a'],['φῶς','n3c'],['ἀνθρακιά','n1a'],['ὕδωρ','n3c'],['ἰκμάς','n3c'],['ὑετός','n2a'],['κρύσταλλος','n2a'],['χιών','n3f'],['χάλαζα','n1c'],['γῆ','n1h'],['χοῦς','n3e'],['κονιορτός','n2a'],['βόρβορος','n2a'],['πηλός','n2a'],['πέτρα','n1a'],['λίθος','n2a'],['θεῖον','n2c'],['ψῆφος','n2b'],['ἄμμος','n2b'],['ἴασπις','n3c'],['σάπφιρος','n2b'],['χαλκηδών','n3f'],['σμάραγδος','n2a'],['σαρδόνυξ','n3b'],['σάρδιον','n2c'],['χρυσόλιθος','n2a'],['βήρυλλος','n2a'],['βήρυλλος','n2b'],['τοπάζιον','n2c'],['χρυσόπρασος','n2a'],['ὑάκινθος','n2a'],['ἀμέθυστος','n2b'],['μαργαρίτης','n1f'],['μάρμαρος','n2a'],['κρύσταλλος','n2a'],['ὕαλος','n2b'],['χρυσίον','n2c'],['χρυσός','n2a'],['ἄργυρος','n2a'],['ἀργύριον','n2c'],['ἀργυροκόπος','n2a'],['χαλκός','n2a'],['χαλκολίβανον','n2c'],['σίδηρος','n2a'],['ἰός','n2a'],['βρῶσις','n3e'],['χαλκεύς','n3e'],['φυτεία','n1a'],['δένδρον','n2c'],['ὕλη','n1b'],['ξύλον','n2c'],['συκῆ','n1h'],['συκάμινος','n2b'],['συκομορέα','n1a'],['φοῖνιξ','n3b'],['φοίνιξ','n3b'],['ἐλαία','n1a'],['καλλιέλαιος','n2b'],['ἀγριέλαιος','n2b'],['ἐλαιών','n3f'],['βοτάνη','n1b'],['χόρτος','n2a'],['βάτος','n2a'],['βάτος','n2b'],['ἄκανθα','n1c'],['τρίβολος','n2a'],['κάλαμος','n2a'],['σίναπι','n3e'],['ἄψινθος','n2b'],['πήγανον','n2c'],['ἡδύοσμον','n2c'],['ἄνηθον','n2c'],['κύμινον','n2c'],['ὕσσωπος','n2b'],['ἄμπελος','n2b'],['ἀμπελών','n3f'],['λάχανον','n2c'],['ζιζάνιον','n2c'],['σῖτος','n2a'],['κρίνον','n2c'],['καρπός','n2a'],['ὀπώρα','n1a'],['κόκκος','n2a'],['σπέρμα','n3c'],['σπόρος','n2a'],['σῦκον','n2c'],['ὄλυνθος','n2a'],['βότρυς','n3e'],['σταφυλή','n1b'],['ἐλαία','n1a'],['στάχυς','n3e'],['σῖτος','n2a'],['σιτίον','n2c'],['ἅλων','n3f'],['κριθή','n1b'],['κεράτιον','n2c'],['ῥίζα','n1c'],['χόρτος','n2a'],['κλάδος','n2a'],['κλῆμα','n3c'],['φύλλον','n2c'],['στιβάς','n3c'],['βάϊον','n2c'],['φοίνιξ','n3b'],['σκόλοψ','n3a'],['κάλαμος','n2a'],['ἄνθος','n3d'],['ἄχυρον','n2c'],['καλάμη','n1b'],['πιότης','n3c'],['ξύλον','n2c'],['ὕλη','n1b'],['φρύγανον','n2c'],['κάρφος','n3d'],['ἄνθραξ','n3b'],['ζῷον','n2c'],['θηρίον','n2c'],['τετράπους','n3c'],['θρέμμα','n3c'],['κτῆνος','n3d'],['ὑποζύγιον','n2c'],['ἀγέλη','n1b'],['υἱός','n2a'],['ἀλώπηξ','n3b'],['λύκος','n2a'],['ἄρκος','n2a'],['ἄρκος','n2b'],['πάρδαλις','n3e'],['λέων','n3c'],['βοῦς','n3e'],['ταῦρος','n2a'],['μόσχος','n2a'],['δάμαλις','n3e'],['ἔριφος','n2a'],['ἐρίφιον','n2c'],['τράγος','n2a'],['πρόβατον','n2c'],['ἀρήν','n3f'],['ἀμνός','n2a'],['ἀρνίον','n2c'],['πάσχα','n3g'],['ποίμνη','n3f'],['ἵππος','n2a'],['κάμηλος','n2a'],['κάμηλος','n2b'],['ὄνος','n2a'],['ὄνος','n2b'],['πῶλος','n2a'],['ὀνάριον','n2c'],['κύων','n3f'],['κυνάριον','n2c'],['χοῖρος','n2a'],['ὗς','n3e'],['πετεινόν','n2c'],['ὄρνις','n3c'],['ὄρνεον','n2c'],['νοσσίον','n2c'],['νοσσός','n2a'],['νοσσιά','n1a'],['ἀετός','n2a'],['κόραξ','n3b'],['περιστερά','n1a'],['τρυγών','n3f'],['ἀλέκτωρ','n3f'],['στρουθίον','n2c'],['ἀκρίς','n3c'],['κώνωψ','n3a'],['σής','n3c'],['ἑρπετόν','n2c'],['ὄφις','n3e'],['ἀσπίς','n3c'],['ἔχιδνα','n1c'],['δράκων','n3c'],['βάτραχος','n2a'],['σκορπίος','n2a'],['σκώληξ','n3b'],['ἰχθύς','n3e'],['ἰχθύδιον','n2c'],['κῆτος','n3d'],['χόρτασμα','n3c'],['ἐπισιτισμός','n2a'],['ἄρτος','n2a'],['τροφή','n1b'],['διατροφή','n1b'],['βρῶμα','n3c'],['βρῶσις','n3e'],['σιτίον','n2c'],['σιτομέτριον','n2c'],['ψωμίον','n2c'],['ψιχίον','n2c'],['ψίξ','n3b'],['πόσις','n3e'],['πόμα','n3c'],['βρῶμα','n3c'],['βρῶσις','n3e'],['ἄρτος','n2a'],['ἄλευρον','n2c'],['σεμίδαλις','n3e'],['ζύμη','n1b'],['κρέας','n3d'],['ὀψάριον','n2c'],['προσφάγιον','n2c'],['ᾠόν','n2c'],['γάλα','n3c'],['κηρίον','n2c'],['μάννα','n3g'],['ἄμωμον','n2c'],['κιννάμωμον','n2c'],['ἅλς','n3f'],['ἅλας','n3c'],['σκεῦος','n3d'],['σκευή','n1b'],['ὅπλον','n2c'],['ἄροτρον','n2c'],['δρέπανον','n2c'],['πτύον','n2c'],['χαλινός','n2a'],['ζυγός','n2a'],['κέντρον','n2c'],['ἄγκιστρον','n2c'],['δίκτυον','n2c'],['ἀμφίβληστρον','n2c'],['σαγήνη','n1b'],['δεσμός','n2a'],['σειρά','n1a'],['ἅλυσις','n3e'],['πέδη','n1b'],['σχοινίον','n2c'],['ζευκτηρία','n1a'],['ἱμάς','n3c'],['ξύλον','n2c'],['ἧλος','n2a'],['σειρά','n1a'],['παγίς','n3c'],['θήρα','n1a'],['σκάνδαλον','n2c'],['φραγέλλιον','n2c'],['σταυρός','n2a'],['ξύλον','n2c'],['ὅπλον','n2c'],['πανοπλία','n1a'],['ξύλον','n2c'],['ῥομφαία','n1a'],['μάχαιρα','n1c'],['λόγχη','n1b'],['ὑσσός','n2a'],['βέλος','n3d'],['τόξον','n2c'],['περικεφαλαία','n1a'],['θώραξ','n3b'],['θυρεός','n2a'],['πλοῖον','n2c'],['πλοιάριον','n2c'],['ναῦς','n3e'],['κιβωτός','n2b'],['σκάφη','n1b'],['πρῷρα','n1c'],['πρύμνα','n1c'],['ἄγκυρα','n1a'],['ἀρτέμων','n3f'],['πηδάλιον','n2c'],['ἅρμα','n3c'],['ῥέδη','n1b'],['σφραγίς','n3c'],['κάλαμος','n2a'],['μέλαν','n3f'],['χάρτης','n1f'],['μεμβράνα','n1c'],['πινακίδιον','n2c'],['πλάξ','n3b'],['σφραγίς','n3c'],['ἐπιστολή','n1b'],['γράμμα','n3c'],['βιβλίον','n2c'],['βίβλος','n2b'],['βιβλαρίδιον','n2c'],['μεμβράνα','n1c'],['κεφαλίς','n3c'],['χρῆμα','n3c'],['νόμισμα','n3c'],['κέρμα','n3c'],['χαλκός','n2a'],['ἄργυρος','n2a'],['ἀργύριον','n2c'],['χρυσός','n2a'],['δηνάριον','n2c'],['δραχμή','n1b'],['ἀσσάριον','n2c'],['κοδράντης','n1f'],['στατήρ','n3f'],['μνᾶ','n1h'],['τάλαντον','n2c'],['κιθάρα','n1a'],['κιθαρῳδός','n2a'],['αὐλός','n2a'],['αὐλητής','n1f'],['σάλπιγξ','n3b'],['σαλπιστής','n1f'],['κύμβαλον','n2c'],['εἰκών','n3f'],['τύπος','n2a'],['χάραγμα','n3c'],['εἴδωλον','n2c'],['χερούβ','n3g'],['ναός','n2a'],['λαμπάς','n3c'],['φῶς','n3c'],['φανός','n2a'],['λύχνος','n2a'],['λυχνία','n1a'],['κλίνη','n1b'],['κλινίδιον','n2c'],['κλινάριον','n2c'],['κράβαττος','n2a'],['κοίτη','n1b'],['σορός','n2b'],['προσκεφάλαιον','n2c'],['καθέδρα','n1a'],['θρόνος','n2a'],['τράπεζα','n1c'],['θυσιαστήριον','n2c'],['βωμός','n2a'],['θυμιατήριον','n2c'],['ὑποπόδιον','n2c'],['σκεῦος','n3d'],['θήκη','n1b'],['ἀγγεῖον','n2c'],['ἄγγος','n3d'],['ποτήριον','n2c'],['νιπτήρ','n3f'],['ἄντλημα','n3c'],['φιάλη','n1b'],['στάμνος','n2b'],['ξέστης','n1f'],['ὑδρία','n1a'],['κεράμιον','n2c'],['κεραμεύς','n3e'],['χαλκίον','n2c'],['ἀλάβαστρον','n2c'],['ἀσκός','n2a'],['σπόγγος','n2a'],['πίναξ','n3b'],['παροψίς','n3c'],['τρύβλιον','n2c'],['φάτνη','n1b'],['λιβανωτός','n2a'],['κιβωτός','n2b'],['θησαυρός','n2a'],['γαζοφυλάκιον','n2c'],['δῶρον','n2c'],['γλωσσόκομον','n2c'],['βαλλάντιον','n2c'],['πήρα','n1a'],['κατασκήνωσις','n3e'],['σαργάνη','n1b'],['σπυρίς','n3c'],['κόφινος','n2a'],['μόδιος','n2a'],['ῥάκος','n3d'],['ὀθόνη','n1b'],['ὀθόνιον','n2c'],['σινδών','n3f'],['κειρία','n1a'],['ἐπίβλημα','n3c'],['σουδάριον','n2c'],['καταπέτασμα','n3c'],['λέντιον','n2c'],['ἔνδυμα','n3c'],['ἐσθής','n3c'],['ἱματισμός','n2a'],['ἱμάτιον','n2c'],['χιτών','n3f'],['περιβόλαιον','n2c'],['σκέπασμα','n3c'],['σάκκος','n2a'],['λίνον','n2c'],['βύσσος','n2b'],['πορφύρα','n1a'],['ἔριον','n2c'],['ἐπενδύτης','n1f'],['ἱμάτιον','n2c'],['περιβόλαιον','n2c'],['φαιλόνης','n1f'],['χλαμύς','n3c'],['στολή','n1b'],['χιτών','n3f'],['κάλυμμα','n3c'],['ζώνη','n1b'],['σιμικίνθιον','n2c'],['κράσπεδον','n2c'],['κόλπος','n2a'],['ὑπόδημα','n3c'],['σανδάλιον','n2c'],['δέρμα','n3c'],['βυρσεύς','n3e'],['μηλωτή','n1b'],['κόσμος','n2a'],['χρυσίον','n2c'],['δακτύλιος','n2a'],['στέφανος','n2a'],['στέμμα','n3c'],['κράσπεδον','n2c'],['φυλακτήριον','n2c'],['διάδημα','n3c'],['οἶνος','n2a'],['γλεῦκος','n3d'],['σίκερα','n3g'],['ὄξος','n3d'],['ἔλαιον','n2c'],['κολλούριον','n2c'],['μύρον','n2c'],['ἄρωμα','n3c'],['σμύρνα','n1c'],['ἀλόη','n1b'],['νάρδος','n2b'],['θυμίαμα','n3c'],['λίβανος','n2a'],['κάλαμος','n2a'],['ζυγός','n2a'],['ῥαφίς','n3c'],['βελόνη','n1b'],['τρῆμα','n3c'],['ἀξίνη','n1b'],['ῥάβδος','n2b'],['κλῆρος','n2a'],['κλείς','n3c'],['ἔσοπτρον','n2c'],['ὕαλος','n2b'],['κέραμος','n2a'],['σκύβαλον','n2c'],['οἶκος','n2a'],['οἰκία','n1a'],['ἔπαυλις','n3e'],['αὐλή','n1b'],['πραιτώριον','n2c'],['σκήνωμα','n3c'],['σκηνή','n1b'],['σκηνοποιός','n2a'],['κατάλυμα','n3c'],['πανδοχεῖον','n2c'],['πανδοχεύς','n3e'],['ἀκροατήριον','n2c'],['σχολή','n1b'],['ναός','n2a'],['ἱερόν','n2c'],['σκηνή','n1b'],['εἰδωλεῖον','n2c'],['συναγωγή','n1b'],['ὀχύρωμα','n3c'],['παρεμβολή','n1b'],['πύργος','n2a'],['δεσμωτήριον','n2c'],['φυλακή','n1b'],['τήρησις','n3e'],['ἀποθήκη','n1b'],['οἴκημα','n3c'],['ἀνάγαιον','n2c'],['ὑπερῷον','n2c'],['κοιτών','n3f'],['κατάλυμα','n3c'],['ξενία','n1a'],['ταμεῖον','n2c'],['θησαυρός','n2a'],['κορβανᾶς','n1e'],['γαζοφυλάκιον','n2c'],['νυμφών','n3f'],['γάμος','n2a'],['τρίστεγον','n2c'],['προαύλιον','n2c'],['θύρα','n1a'],['στοά','n1a'],['θεμέλιος','n2a'],['θεμέλιον','n2c'],['ἐνδώμησις','n3e'],['στῦλος','n2a'],['τοῖχος','n2a'],['θυρίς','n3c'],['πύλη','n1b'],['πυλών','n3f'],['στέγη','n1b'],['δῶμα','n3c'],['ἀναβαθμός','n2a'],['πτερύγιον','n2c'],['θέατρον','n2c'],['στάδιον','n2c'],['αὐλή','n1b'],['πηγή','n1b'],['φρέαρ','n3c'],['κολυμβήθρα','n1a'],['φραγμός','n2a'],['χάραξ','n3b'],['τεῖχος','n3d'],['μεσότοιχον','n2c'],['βῆμα','n3c'],['φάτνη','n1b'],['ἅλων','n3f'],['ληνός','n2b'],['ὑπολήνιον','n2c'],['μύλος','n2a'],['ἀφεδρών','n3f'],['κάμινος','n2b'],['κλίβανος','n2a'],['τάφος','n2a'],['μνῆμα','n3c'],['μνημεῖον','n2c'],['ἐνδώμησις','n3e'],['δοκός','n2b'],['σανίς','n3c'],['σῶμα','n3c'],['σάρξ','n3b'],['σκῆνος','n3d'],['σκήνωμα','n3c'],['σκεῦος','n3d'],['πτῶμα','n3c'],['κῶλον','n2c'],['μέλος','n3d'],['κεφαλή','n1b'],['κρανίον','n2c'],['θρίξ','n3b'],['κόμη','n1b'],['ἔριον','n2c'],['μέτωπον','n2c'],['κέρας','n3c'],['πρόσωπον','n2c'],['ὄψις','n3e'],['στόμα','n3c'],['ὀδούς','n3c'],['γλῶσσα','n1c'],['σιαγών','n3f'],['ὀφθαλμός','n2a'],['ὄμμα','n3c'],['οὖς','n3c'],['ὠτίον','n2c'],['ὠτάριον','n2c'],['τράχηλος','n2a'],['λάρυγξ','n3b'],['ὦμος','n2a'],['ἀγκάλη','n1b'],['πτέρυξ','n3b'],['χείρ','n3f'],['αὐτόχειρ','n3f'],['δάκτυλος','n2a'],['πυγμή','n1b'],['στῆθος','n3d'],['μαστός','n2a'],['θώραξ','n3b'],['κόλπος','n2a'],['νῶτος','n2a'],['πλευρά','n1a'],['ὀσφῦς','n3e'],['οὐρά','n1a'],['κέντρον','n2c'],['σκέλος','n3d'],['γόνυ','n3c'],['μηρός','n2a'],['πούς','n3c'],['βάσις','n3e'],['σφυδρόν','n2c'],['πτέρνα','n1c'],['χρώς','n3c'],['ῥυτίς','n3c'],['στίγμα','n3c'],['τύπος','n2a'],['λεπίς','n3c'],['σπλάγχνον','n2c'],['ἁρμός','n2a'],['ἁφή','n1b'],['ὀστοῦν','n2d'],['ὀστέον','n2c'],['μυελός','n2a'],['σάρξ','n3b'],['αἷμα','n3c'],['θρόμβος','n2a'],['στόμαχος','n2a'],['κοιλία','n1a'],['γαστήρ','n3f'],['μήτρα','n1a'],['ἐξέραμα','n3c'],['πτύσμα','n3c'],['ἱδρώς','n3c'],['δάκρυον','n2c'],['ἰός','n2a'],['χολή','n1b'],['κόπριον','n2c'],['κοπρία','n1a'],['ἄνθρωπος','n2a'],['ἀνήρ','n3f'],['υἱός','n2a'],['σῶμα','n3c'],['πρόσωπον','n2c'],['σάρξ','n3b'],['γόνυ','n3c'],['χείρ','n3f'],['γλῶσσα','n1c'],['ὄνομα','n3c'],['ψυχή','n1b'],['σκεῦος','n3d'],['οἰκουμένη','n1b'],['γῆ','n1h'],['κόσμος','n2a'],['ἄνθρωπος','n2a'],['ἀνήρ','n3f'],['εὐνοῦχος','n2a'],['γέρων','n3c'],['πρεσβύτης','n1f'],['νεανίσκος','n2a'],['νεανίας','n1d'],['παρθένος','n2a'],['παρθένος','n2b'],['γυνή','n3b'],['γυναικάριον','n2c'],['πρεσβῦτις','n3c'],['παρθένος','n2a'],['παρθένος','n2b'],['κοράσιον','n2c'],['παῖς','n3c'],['παιδίον','n2c'],['παιδάριον','n2c'],['βρέφος','n3d'],['παιδίον','n2c'],['τέκνον','n2c'],['τεκνίον','n2c'],['υἱός','n2a'],['θυγάτηρ','n3f'],['ταλιθα','n3g'],['γένος','n3d'],['σάρξ','n3b'],['φυλή','n1b'],['δωδεκάφυλον','n2c'],['γενεά','n1a'],['συγγένεια','n1a'],['συγγενίς','n3c'],['οἶκος','n2a'],['οἰκία','n1a'],['οἰκιακός','n2a'],['πατήρ','n3f'],['μήτηρ','n3f'],['γονεύς','n3e'],['μάμμη','n1b'],['προπάτωρ','n3f'],['πατριάρχης','n1f'],['σπορά','n1a'],['γένεσις','n3e'],['οἶκος','n2a'],['πατριά','n1a'],['γενεαλογία','n1a'],['γενεά','n1a'],['τέκνον','n2c'],['σπέρμα','n3c'],['υἱός','n2a'],['θυγάτηρ','n3f'],['γένος','n3d'],['ῥίζα','n1c'],['τέκνον','n2c'],['παῖς','n3c'],['παιδίον','n2c'],['υἱός','n2a'],['πρωτοτόκια','n2c'],['θυγάτηρ','n3f'],['θυγάτριον','n2c'],['ἀδελφός','n2a'],['ἀδελφή','n1b'],['ἀνεψιός','n2a'],['ἄνθρωπος','n2a'],['ἀνήρ','n3f'],['γυνή','n3b'],['σκεῦος','n3d'],['νυμφίος','n2a'],['νύμφη','n1b'],['πενθερός','n2a'],['πενθερά','n1a'],['νύμφη','n1b'],['χήρα','n1a'],['ὄχλος','n2a'],['πλῆθος','n3d'],['λαός','n2a'],['ὅμιλος','n2a'],['νέφος','n3d'],['γενεά','n1a'],['κλισία','n1a'],['συμπόσιον','n2c'],['πρασιά','n1a'],['μέρος','n3d'],['λαός','n2a'],['ἀδελφότης','n3c'],['ἀδελφός','n2a'],['ἀδελφή','n1b'],['ἀδελφός','n2a'],['πατήρ','n3f'],['ἀρνίον','n2c'],['πρόβατον','n2c'],['ποίμνιον','n2c'],['ἐκκλησία','n1a'],['σῶμα','n3c'],['Χριστιανός','n2a'],['ψευδάδελφος','n2a'],['Ἕλλην','n3f'],['συναγωγή','n1b'],['ἐφημερία','n1a'],['Σαδδουκαῖος','n2a'],['Φαρισαῖος','n2a'],['αἵρεσις','n3e'],['ἀκροβυστία','n1a'],['προσήλυτος','n2a'],['ἔθνος','n3d'],['λαός','n2a'],['πατριά','n1a'],['φυλή','n1b'],['συμφυλέτης','n1f'],['ἀδελφός','n2a'],['τόπος','n2a'],['πόλις','n3e'],['κώμη','n1b'],['τέκνον','n2c'],['χώρα','n1a'],['θυγάτηρ','n3f'],['πολίτης','n1f'],['υἱός','n2a'],['πολιτεία','n1a'],['πολίτευμα','n3c'],['συμπολίτης','n1f'],['ἐκκλησία','n1a'],['δῆμος','n2a'],['συνέδριον','n2c'],['Ἀρεοπαγίτης','n1f'],['γερουσία','n1a'],['πρεσβυτέριον','n2c'],['βουλευτής','n1f'],['συμβούλιον','n2c'],['Ηρῳδιανοί','n2a'],['ζηλωτής','n1f'],['Καναναῖος','n2a'],['γείτων','n3f'],['ἀδελφός','n2a'],['Ἕλλην','n3f'],['Ελληνιστής','n1f'],['Ἐπικούρειος','n2a'],['θεός','n2a'],['θεός','n2b'],['ηλι','n3g'],['ελωι','n3g'],['μεγαλωσύνη','n1b'],['παντοκράτωρ','n3f'],['Σαβαώθ','n3g'],['κύριος','n2a'],['μαρανα','n3g'],['πατήρ','n3f'],['αββα','n3g'],['θεότης','n3c'],['θειότης','n3c'],['θεῖον','n2c'],['οὐρανός','n2a'],['πνεῦμα','n3c'],['παράκλητος','n2a'],['εἴδωλον','n2c'],['θεά','n1a'],['δαιμόνιον','n2c'],['δίκη','n1b'],['ἄγγελος','n2a'],['ἀρχάγγελος','n2a'],['ζῷον','n2c'],['πνεῦμα','n3c'],['δαίμων','n3f'],['φάντασμα','n3c'],['στοιχεῖον','n2c'],['ἀρχή','n1b'],['ἐξουσία','n1a'],['κοσμοκράτωρ','n3f'],['δύναμις','n3e'],['κυριότης','n3c'],['θρόνος','n2a'],['ὕψωμα','n3c'],['βάθος','n3d'],['πύθων','n3f'],['δόξα','n1c'],['ἥττημα','n3c'],['ἀθέτησις','n3e'],['γένημα','n3c'],['μετάθεσις','n3e'],['προκοπή','n1b'],['πτῶσις','n3e'],['ἀνάστασις','n3e'],['ἀποκατάστασις','n3e'],['γένεσις','n3e'],['στάσις','n3e'],['ἀφανισμός','n2a'],['ἀποβολή','n1b'],['πρᾶγμα','n3c'],['λόγος','n2a'],['ῥῆμα','n3c'],['συγκυρία','n1a'],['τελείωσις','n3e'],['συγγνώμη','n1b'],['ἐγκοπή','n1b'],['ὄγκος','n2a'],['εὐδία','n1a'],['χειμών','n3f'],['ἄνεμος','n2a'],['πνεῦμα','n3c'],['πνοή','n1b'],['θύελλα','n1c'],['λαῖλαψ','n3a'],['νότος','n2a'],['Εὐρακύλων','n3f'],['ὑετός','n2a'],['βροχή','n1b'],['ὄμβρος','n2a'],['βροντή','n1b'],['ἀστραπή','n1b'],['ῥύσις','n3e'],['σεισμός','n2a'],['γαλήνη','n1b'],['κῦμα','n3c'],['κλύδων','n3f'],['σάλος','n2a'],['ἀφρός','n2a'],['πλήμμυρα','n1c'],['κατακλυσμός','n2a'],['φῶς','n3c'],['φέγγος','n3d'],['ἡμέρα','n1a'],['ἀστραπή','n1b'],['ἀπαύγασμα','n3c'],['λαμπρότης','n3c'],['δόξα','n1c'],['φωστήρ','n3f'],['σκότος','n3d'],['σκοτία','n1a'],['γνόφος','n2a'],['ζόφος','n2a'],['νύξ','n3c'],['σκιά','n1a'],['ἀποσκίασμα','n3c'],['καῦσις','n3e'],['πύρωσις','n3e'],['καύσων','n3f'],['καῦμα','n3c'],['σποδός','n2b'],['φωνή','n1b'],['φθόγγος','n2a'],['ἦχος','n2a'],['ἦχος','n3d'],['θόρυβος','n2a'],['συμφωνία','n1a'],['σεισμός','n2a'],['μετάθεσις','n3e'],['πορεία','n1a'],['ὁδός','n2b'],['ὁδοιπορία','n1a'],['πλανήτης','n1f'],['πάροδος','n2b'],['ἄφιξις','n3e'],['φυγή','n1b'],['ἔξοδος','n2b'],['ἀπάντησις','n3e'],['ὑπάντησις','n3e'],['ἔλευσις','n3e'],['παρουσία','n1a'],['εἴσοδος','n2b'],['ἀνάλημψις','n3e'],['ἀνατολή','n1b'],['κατάβασις','n3e'],['ἐπισυναγωγή','n1b'],['συνδρομή','n1b'],['διασπορά','n1a'],['συνοδία','n1a'],['συνέκδημος','n2a'],['ὁδηγός','n2a'],['χειραγωγός','n2c'],['φορτίον','n2c'],['βολή','n1b'],['ἐκβολή','n1b'],['πρόσκομμα','n3c'],['χορός','n2a'],['κίνησις','n3e'],['ταραχή','n1b'],['ῥιπή','n1b'],['τρόμος','n2a'],['τροπή','n1b'],['κυλισμός','n2a'],['κουμ','n3g'],['ἄγρα','n1a'],['δέσμη','n1b'],['σύνδεσμος','n2a'],['πληγή','n1b'],['ῥάπισμα','n3c'],['μάστιξ','n3b'],['ἱμάς','n3c'],['κατατομή','n1b'],['σχίσμα','n3c'],['κλάσις','n3e'],['κλάσμα','n3c'],['βία','n1a'],['βιαστής','n1f'],['κάκωσις','n3e'],['καταστροφή','n1b'],['ὕβρις','n3e'],['τραῦμα','n3c'],['μώλωψ','n3a'],['πληγή','n1b'],['ἀπώλεια','n1a'],['ὄλεθρος','n2a'],['ὀλοθρευτής','n1f'],['φθορά','n1a'],['ἐρήμωσις','n3e'],['καταστροφή','n1b'],['πτῶσις','n3e'],['καθαίρεσις','n3e'],['ῥῆγμα','n3c'],['σύντριμμα','n3c'],['μάρτυς','n3f'],['μάχαιρα','n1c'],['κέντρον','n2c'],['σπεκουλάτωρ','n3f'],['ἀναίρεσις','n3e'],['σφαγή','n1b'],['κοπή','n1b'],['φόνος','n2a'],['αἷμα','n3c'],['φονεύς','n3e'],['ἀνδροφόνος','n2a'],['ἀνθρωποκτόνος','n2a'],['σικάριος','n2a'],['μητρολῴας','n1d'],['πατρολῴας','n1d'],['κίνδυνος','n2a'],['παγίς','n3c'],['σπιλάς','n3c'],['ἀσφάλεια','n1a'],['στηριγμός','n2a'],['ἔκβασις','n3e'],['σωτηρία','n1a'],['σωτήρ','n3f'],['σωτηρία','n1a'],['σωτήρ','n3f'],['ἀνάγκη','n1b'],['θλῖψις','n3e'],['βάρος','n3d'],['κακία','n1a'],['λοιμός','n2a'],['κόπος','n2a'],['στενοχωρία','n1a'],['ταλαιπωρία','n1a'],['πληγή','n1b'],['προσκοπή','n1b'],['ἀνάψυξις','n3e'],['ἄνεσις','n3e'],['ἀνάπαυσις','n3e'],['εἰρήνη','n1b'],['ἡσυχία','n1a'],['βρῶσις','n3e'],['γαστήρ','n3f'],['ἄριστον','n2c'],['δεῖπνον','n2c'],['τράπεζα','n1c'],['δοχή','n1b'],['ἀγάπη','n1b'],['νῆστις','n3c'],['νῆστις','n3e'],['νηστεία','n1a'],['λιμός','n2a'],['λιμός','n2b'],['ἀσιτία','n1a'],['πόσις','n3e'],['δίψος','n3d'],['γένεσις','n3e'],['τεκνογονία','n1a'],['γέννημα','n3c'],['ὠδίν','n3f'],['ἔκτρωμα','n3c'],['στεῖρα','n1a'],['νέκρωσις','n3e'],['κοίτη','n1b'],['παρθενία','n1a'],['χρῆσις','n3e'],['κοίμησις','n3e'],['ὕπνος','n2a'],['ἀγρυπνία','n1a'],['ἀνάπαυσις','n3e'],['κατάπαυσις','n3e'],['ζωή','n1b'],['ψυχή','n1b'],['σάρξ','n3b'],['ἀνάστασις','n3e'],['ἐξανάστασις','n3e'],['ἔγερσις','n3e'],['θάνατος','n2a'],['νέκρωσις','n3e'],['ἀνάλυσις','n3e'],['ἔξοδος','n2b'],['τελευτή','n1b'],['αἷμα','n3c'],['ᾅδης','n1f'],['ἀθανασία','n1a'],['ὁλοκληρία','n1a'],['ἴασις','n3e'],['ἴαμα','n3c'],['θεραπεία','n1a'],['ἰατρός','n2a'],['ἀσθένεια','n1a'],['μάστιξ','n3b'],['μαλακία','n1a'],['νόσος','n2b'],['νόσημα','n3c'],['δεσμός','n2a'],['πληγή','n1b'],['θάνατος','n2a'],['πυρετός','n2a'],['δυσεντέριον','n2c'],['λέπρα','n1a'],['γάγγραινα','n1c'],['ἕλκος','n3d'],['αἱματεκχυσία','n1a'],['λοιμός','n2a'],['πνεῦμα','n3c'],['πνοή','n1b'],['αὔξησις','n3e'],['φθορά','n1a'],['διαφθορά','n1a'],['εἶδος','n3d'],['ὅραμα','n3c'],['θεωρία','n1a'],['θέατρον','n2c'],['ὀφθαλμός','n2a'],['ἐπιφάνεια','n1a'],['πρόσωπον','n2c'],['ὅρασις','n3e'],['αἴνιγμα','n3c'],['ἀνάβλεψις','n3e'],['αὐτόπτης','n1f'],['ἐπόπτης','n1f'],['παρατήρησις','n3e'],['βλέμμα','n3c'],['ἀκοή','n1b'],['οὖς','n3c'],['ἀκροατής','n1f'],['ὄσφρησις','n3e'],['πόνος','n2a'],['πάθημα','n3c'],['κέντρον','n2c'],['ὠδίν','n3f'],['κακοπάθεια','n1a'],['βάσανος','n2b'],['βασανισμός','n2a'],['πύρωσις','n3e'],['θέλησις','n3e'],['θέλημα','n3c'],['βούλημα','n3c'],['εὐδοκία','n1a'],['ἐπιθυμητής','n1f'],['πλησμονή','n1b'],['ἐπιποθία','n1a'],['ἐπιπόθησις','n3e'],['θυμός','n2a'],['ἐπιθυμία','n1a'],['πλεονεξία','n1a'],['πλεονέκτης','n1f'],['ἁρπαγή','n1b'],['ἡδονή','n1b'],['κοιλία','n1a'],['πάθος','n3d'],['πάθημα','n3c'],['φιλία','n1a'],['φιλαδελφία','n1a'],['φιλανθρωπία','n1a'],['ἀγάπη','n1b'],['ζῆλος','n2a'],['ζῆλος','n3d'],['σπλάγχνον','n2c'],['ἐλπίς','n3c'],['ἀποκαραδοκία','n1a'],['προθυμία','n1a'],['ἐκτένεια','n1a'],['εὔνοια','n1a'],['σπουδή','n1b'],['ζηλωτής','n1f'],['αὐτάρκεια','n1a'],['εὐδοκία','n1a'],['χάρις','n3c'],['ἀρεσκεία','n1a'],['φιλαργυρία','n1a'],['ἡδονή','n1b'],['ἀπόλαυσις','n3e'],['ἱλαρότης','n3c'],['μακαρισμός','n2a'],['εὐφροσύνη','n1b'],['χαρά','n1a'],['ἀγαλλίασις','n3e'],['κλαυθμός','n2a'],['κραυγή','n1b'],['πένθος','n3d'],['στεναγμός','n2a'],['γέλως','n3c'],['ἀνάψυξις','n3e'],['παράκλησις','n3e'],['παραμύθιον','n2c'],['παραμυθία','n1a'],['παρηγορία','n1a'],['παρρησία','n1a'],['τολμητής','n1f'],['μακροθυμία','n1a'],['ἀνοχή','n1b'],['ὑπομονή','n1b'],['σκάνδαλον','n2c'],['προσκοπή','n1b'],['πρόσκομμα','n3c'],['βδέλυγμα','n3c'],['αἰσχύνη','n1b'],['ἐντροπή','n1b'],['ἀσχημοσύνη','n1b'],['καύχημα','n3c'],['καύχησις','n3e'],['δόξα','n1c'],['θάμβος','n2c'],['θάμβος','n3d'],['θαῦμα','n3c'],['ἔκστασις','n3e'],['μέριμνα','n1c'],['ὀδύνη','n1b'],['ἐπίστασις','n3e'],['συνοχή','n1b'],['τάραχος','n2a'],['εἰρήνη','n1b'],['φόβος','n2a'],['φόβητρον','n2c'],['πτόησις','n3e'],['δειλία','n1a'],['ἀσθένεια','n1a'],['λύπη','n1b'],['ἀγωνία','n1a'],['κατήφεια','n1a'],['καρδία','n1a'],['ψυχή','n1b'],['σάρξ','n3b'],['πνεῦμα','n3c'],['σπλάγχνον','n2c'],['κοιλία','n1a'],['νεφρός','n2a'],['ὁρμή','n1b'],['συνείδησις','n3e'],['νοῦς','n3e'],['νόημα','n3c'],['διάνοια','n1a'],['φρήν','n3f'],['φρόνησις','n3e'],['φρόνημα','n2c'],['μαθητής','n1f'],['γράμμα','n3c'],['γραμματεύς','n3e'],['ἰδιώτης','n1f'],['ζήτησις','n3e'],['δοκιμή','n1b'],['δοκίμιον','n2c'],['δοκιμασία','n1a'],['πειρασμός','n2a'],['κατάσκοπος','n2a'],['πώρωσις','n3e'],['γνῶσις','n3e'],['ἐπίγνωσις','n3e'],['συνείδησις','n3e'],['πρόγνωσις','n3e'],['σοφία','n1a'],['γνώστης','n1f'],['καρδιογνώστης','n1f'],['ἄγνοια','n1a'],['ἀγνωσία','n1a'],['γνῶσις','n3e'],['ἐπίγνωσις','n3e'],['πρόγνωσις','n3e'],['φανέρωσις','n3e'],['φωτισμός','n2a'],['ἀποκάλυψις','n3e'],['χρηματισμός','n2a'],['βεβαίωσις','n3e'],['τεκμήριον','n2c'],['δεῖγμα','n3c'],['ἔνδειξις','n3e'],['ἔνδειγμα','n3c'],['ἀπόδειξις','n3e'],['ἐπικάλυμμα','n3c'],['μυστήριον','n2c'],['κρύπτη','n1b'],['μνήμη','n3c'],['μνεία','n1a'],['ὑπόμνησις','n3e'],['ἀνάμνησις','n3e'],['μνημόσυνον','n2c'],['ἐπιλησμονή','n1b'],['λήθη','n1b'],['μνεία','n1a'],['νοῦς','n3e'],['διάνοια','n1a'],['ἔννοια','n1a'],['πνεῦμα','n3c'],['διαλογισμός','n2a'],['λογισμός','n2a'],['λόγος','n2a'],['ὄψις','n3e'],['ἐνθύμησις','n3e'],['νόημα','n3c'],['διάνοια','n1a'],['διανόημα','n3c'],['κατάνυξις','n3e'],['μανία','n1a'],['παραφρονία','n1a'],['πρόνοια','n1a'],['πάρεσις','n3e'],['ἐκδοχή','n1b'],['προσδοκία','n1a'],['βούλημα','n3c'],['βουλή','n1b'],['θέλημα','n3c'],['πρόθεσις','n3e'],['ἔννοια','n1a'],['ἐπίνοια','n1a'],['γνώμη','n1b'],['οἰκονομία','n1a'],['ἐφευρετής','n1f'],['ἐπιβουλή','n1b'],['συστροφή','n1b'],['συνωμοσία','n1a'],['συμβούλιον','n2c'],['πρόκριμα','n3c'],['ἐκλογή','n1b'],['κρίσις','n3e'],['κρίμα','n3c'],['διάκρισις','n3e'],['ἐξουσία','n1a'],['γνώμη','n1b'],['πλάνη','n1b'],['ἀπάτη','n1b'],['φρεναπάτης','n1f'],['γνώμη','n1b'],['συμφώνησις','n3e'],['συγκατάθεσις','n3e'],['μεσίτης','n1f'],['ὑπόνοια','n1a'],['ἐκζήτησις','n3e'],['διαλογισμός','n2a'],['ἀσφάλεια','n1a'],['πίστις','n3e'],['πληροφορία','n1a'],['ἀποδοχή','n1b'],['ἀκοή','n1b'],['ἐπιστροφή','n1b'],['ὑπόστασις','n3e'],['πίστις','n3e'],['ἀπιστία','n1a'],['ἑδραίωμα','n3c'],['ὀλιγοπιστία','n1a'],['ἀπιστία','n1a'],['πίστις','n3e'],['ἀπιστία','n1a'],['ἀπείθεια','n1a'],['σύνεσις','n3e'],['ἀγνωσία','n1a'],['ἀπορία','n1a'],['γνῶσις','n3e'],['αἴνιγμα','n3c'],['ὀφθαλμός','n2a'],['σύνεσις','n3e'],['αἴσθησις','n3e'],['αἰσθητήριον','n2c'],['φρόνησις','n3e'],['σοφία','n1a'],['σωφρονισμός','n2a'],['σωφροσύνη','n1b'],['φιλοσοφία','n1a'],['φιλόσοφος','n2a'],['μάγος','n2a'],['ἄνοια','n1a'],['ἀφροσύνη','n1b'],['μωρία','n1a'],['ῥακά','n3g'],['φωνή','n1b'],['διάλεκτος','n2b'],['γλῶσσα','n1c'],['ῥῆμα','n3c'],['τόπος','n2a'],['περιοχή','n1b'],['γραφή','n1b'],['διήγησις','n3e'],['κεφάλαιον','n2c'],['μῦθος','n2a'],['παροιμία','n1a'],['παραβολή','n1b'],['γένεσις','n3e'],['ἀσπασμός','n2a'],['ποιητής','n1f'],['χρηστολογία','n1a'],['πιθανολογία','n1a'],['αἰσχρολογία','n1a'],['εὐτραπελία','n1a'],['γράμμα','n3c'],['ἰῶτα','n3g'],['κεραία','n1a'],['βίβλος','n2b'],['βιβλίον','n2c'],['χειρόγραφον','n2c'],['ἀποστάσιον','n2c'],['ἀπογραφή','n1b'],['τίτλος','n2a'],['σφραγίς','n3c'],['ἐπιγραφή','n1b'],['ἐπιστολή','n1b'],['λόγος','n2a'],['γραφή','n1b'],['νόμος','n2a'],['Μωϋσῆς','n3g'],['ἀνάγνωσις','n3e'],['προσαγωγή','n1b'],['στόμα','n3c'],['γλῶσσα','n1c'],['χεῖλος','n3d'],['φωνή','n1b'],['βοή','n1b'],['κραυγή','n1b'],['πολυλογία','n1a'],['λόγιον','n2c'],['ῥῆμα','n3c'],['λόγος','n2a'],['λαλιά','n1a'],['φθόγγος','n2a'],['ᾠδή','n1b'],['ψαλμός','n2a'],['ὕμνος','n2a'],['θρῆνος','n2a'],['ἡσυχία','n1a'],['σιγή','n1b'],['ὄνομα','n3c'],['δύναμις','n3e'],['ἐπίλυσις','n3e'],['διερμηνευτής','n1f'],['ἑρμηνεία','n1a'],['ἐπερώτημα','n3c'],['αἴτημα','n3c'],['δέησις','n3e'],['ἱκετηρία','n1a'],['προσαίτης','n1f'],['εὐχή','n1b'],['προσευχή','n1b'],['ἀπόκρισις','n3e'],['ἀγγελία','n1a'],['ἀπόστολος','n2a'],['ἄγγελος','n2a'],['σπεκουλάτωρ','n3f'],['καταγγελεύς','n3e'],['φάσις','n3e'],['φήμη','n1b'],['ἦχος','n3d'],['ἀκοή','n1b'],['εὐαγγέλιον','n2c'],['διδαχή','n1b'],['διδασκαλία','n1a'],['παιδεία','n1a'],['νουθεσία','n1a'],['παράδοσις','n3e'],['αἵρεσις','n3e'],['διδάσκαλος','n2a'],['παιδευτής','n1f'],['καθηγητής','n1f'],['ῥαββί','n3g'],['ραββουνι','n3g'],['νομοδιδάσκαλος','n2a'],['ψευδοδιδάσκαλος','n2a'],['ψεῦδος','n3d'],['ψεῦσμα','n3c'],['ψεύστης','n1f'],['κήρυγμα','n3c'],['κῆρυξ','n3b'],['λόγος','n2a'],['μαρτυρία','n1a'],['μαρύριον','n2c'],['μάρτυς','n3f'],['ψευδομαρτυρία','n1a'],['ψευδόμαρτυς','n3f'],['μαρτύριον','n2c'],['ὁμολογία','n1a'],['ἐπαγγελία','n1a'],['ἐπάγγελμα','n3c'],['ἐπαγγελία','n1a'],['πίστις','n3e'],['ἀπειλή','n1b'],['σύμβουλος','n2a'],['πεισμονή','n1b'],['πειθώ','n3e'],['κλῆσις','n3e'],['κλῆσις','n3e'],['κέλευσμα','n3c'],['ἐπιταγή','n1b'],['διαταγή','n1b'],['διάταγμα','n3c'],['παραγγελία','n1a'],['ἐντολή','n1b'],['ἔνταλμα','n3c'],['δόγμα','n3c'],['νόμος','n2a'],['δόγμα','n3c'],['δικαίωμα','n3c'],['κανών','n3f'],['νομοθεσία','n1a'],['νομοθέτης','n1f'],['ἔντευξις','n3e'],['εὐχαριστία','n1a'],['χάρις','n3c'],['αἶνος','n2a'],['αἴνεσις','n3e'],['ἔπαινος','n2a'],['εὐλογία','n1a'],['εὐφημία','n1a'],['δόξα','n1c'],['ἁλληλουϊά','n3g'],['ὡσαννά','n3g'],['εὐλογία','n1a'],['κολακεία','n1a'],['καύχημα','n3c'],['καύχησις','n3e'],['κενοφωνία','n1a'],['ματαιολογία','n1a'],['μωρολογία','n1a'],['λῆρος','n2a'],['γογγυσμός','n2a'],['μομφή','n1b'],['γογγυστής','n1f'],['καταλαλιά','n1a'],['ὀνειδισμός','n2a'],['ὕβρις','n3e'],['ὑβριστής','n1f'],['λοιδορία','n1a'],['λοίδορος','n2a'],['δυσφημία','n1a'],['βλασφημία','n1a'],['ψιθυρισμός','n2a'],['ψιθυριστής','n1f'],['ἐμπαιγμός','n2a'],['ἐμπαιγμονή','n1b'],['ἐμπαίκτης','n1f'],['ἀπελεγμός','n2a'],['ἔλεγξις','n3e'],['ἐλεγμός','n2a'],['νουθεσία','n1a'],['κατηγορία','n1a'],['κατήγωρ','n3f'],['κατήγορος','n2a'],['ἀπολογία','n1a'],['πρόφασις','n3e'],['συζήτησις','n3e'],['ζήτημα','n3c'],['ζήτησις','n3e'],['συζητητής','n1f'],['ἐκζήτησις','n3e'],['διάκρισις','n3e'],['ἀντιλογία','n1a'],['διαλογισμός','n2a'],['ἔρις','n3c'],['στάσις','n3e'],['φιλονεικία','n1a'],['παροξυσμός','n2a'],['διαπαρατριβή','n1b'],['λογομαχία','n1a'],['ἀντιλογία','n1a'],['ἀντίθεσις','n3e'],['προφητεία','n1a'],['ὅρκος','n2a'],['ὁρκωμοσία','n1a'],['εὐχή','n1b'],['εὐλογία','n1a'],['ἀρά','n1a'],['κατάρα','n1a'],['ἀνάθεμα','n3c'],['κατάθεμα','n3c'],['σύσσημον','n2c'],['σημεῖον','n2c'],['τέρας','n3c'],['στίγμα','n3c'],['χάραγμα','n3c'],['σφραγίς','n3c'],['ὄναρ','n3c'],['ἐνύπνιον','n2c'],['ὅρασις','n3e'],['ὅραμα','n3c'],['ὀπτασία','n1a'],['ἔκστασις','n3e'],['ὁμιλία','n1a'],['κοινωνία','n1a'],['κοινωνός','n2a'],['κοινωνός','n2b'],['συγκοινωνός','n2a'],['μετοχή','n1b'],['φίλη','n1b'],['ἑταῖρος','n2a'],['συστρατιώτης','n1f'],['πρόσλημψις','n3e'],['ἀποβολή','n1b'],['φραγμός','n2a'],['διαθήκη','n1b'],['δικαίωσις','n3e'],['δικαιοσύνη','n1b'],['ἐπισκοπή','n1b'],['εἴσοδος','n2b'],['φιλοξενία','n1a'],['ξενία','n1a'],['φίλημα','n3c'],['γάμος','n2a'],['ἄγαμος','n2a'],['ἄγαμος','n2b'],['παρθένος','n2b'],['λύσις','n3e'],['ἐπικουρία','n1a'],['ἀντίλημψις','n3e'],['βοήθεια','n1a'],['προστάτις','n3c'],['παρηγορία','n1a'],['εὐεργέτης','n1f'],['παράκλητος','n2a'],['διακονία','n1a'],['θεράπων','n3c'],['ὑπηρέτης','n1f'],['διάκονος','n2a'],['διάκονος','n2b'],['λειτουργία','n1a'],['λειτουργός','n2a'],['ὀφθαλμοδουλία','n1a'],['ἐπιχορηγία','n1a'],['διακονία','n1a'],['ἐπισκοπή','n1b'],['ἐπίστασις','n3e'],['ἐπίσκοπος','n2a'],['ἐπιμέλεια','n1a'],['παραθήκη','n1b'],['κλῆρος','n2a'],['τροφός','n2b'],['υἱοθεσία','n1a'],['κυβέρνησις','n3e'],['ὁδηγός','n2a'],['ἐπίτροπος','n2a'],['ἀρχηγός','n2a'],['στῦλος','n2a'],['πατήρ','n3f'],['παιδεία','n1a'],['ὑπακοή','n1b'],['ὑποταγή','n1b'],['τήρησις','n3e'],['ἀπείθεια','n1a'],['παρακοή','n1b'],['παράβασις','n3e'],['παραβάτης','n1f'],['μαθητής','n1f'],['υἱός','n2a'],['τέκνον','n2c'],['μαθήτρια','n1a'],['συμμαθητής','n1f'],['ἐξουσία','n1a'],['χείρ','n3f'],['παγίς','n3c'],['θήρα','n1a'],['δουλεία','n1a'],['ἐξουσία','n1a'],['οἰκονόμος','n2a'],['ἐπιτροπή','n1b'],['ἐπιταγή','n1b'],['κτίσις','n3e'],['κύριος','n2a'],['κυριότης','n3c'],['ῥάβδος','n2b'],['ἀρχή','n1b'],['ἄρχων','n3c'],['ἡγεμονία','n1a'],['ἡγεμών','n3f'],['δύναμις','n3e'],['δυνάστης','n1f'],['δεσπότης','n1f'],['βασιλεία','n1a'],['βασιλεύς','n3e'],['βασίλισσα','n1c'],['θρόνος','n2a'],['κοσμοκράτωρ','n3f'],['Καῖσαρ','n3f'],['Κανδάκη','n1b'],['τετραάρχης','n1f'],['ἐθνάρχης','n1f'],['Ἀσιάρχης','n1f'],['ἀνθύπατος','n2a'],['εὐνοῦχος','n2a'],['ἐπίτροπος','n2a'],['πρεσβεία','n1a'],['ῥαβδοῦχος','n2a'],['στρατηγός','n2a'],['πράκτωρ','n3f'],['πολιτάρχης','n1f'],['γραμματεύς','n3e'],['κλῆρος','n2a'],['χρῖσμα','n3c'],['προδότης','n1f'],['δεσμός','n2a'],['ἅλυσις','n3e'],['δέσμιος','n2a'],['δεσμώτης','n1f'],['συναιχμάλωτος','n2a'],['φύλαξ','n3b'],['τήρησις','n3e'],['φυλακή','n1b'],['δεσμοφύλαξ','n3b'],['βασανιστής','n1f'],['λύτρωσις','n3e'],['ἀπολύτρωσις','n3e'],['λυτρωτής','n1f'],['λύτρον','n2c'],['ἀντίλυτρον','n2c'],['ἄφεσις','n3e'],['ἐλευθερία','n1a'],['ἄνεσις','n3e'],['κρίσις','n3e'],['κόλασις','n3e'],['παιδεία','n1a'],['παιδευτής','n1f'],['τιμωρία','n1a'],['ἐπιτιμία','n1a'],['ἐκδίκησις','n3e'],['δίκη','n1b'],['ὀργή','n1b'],['μισθός','n2a'],['ἀντιμισθία','n1a'],['μισθαποδοσία','n1a'],['μισθαποδότης','n1f'],['ἀνταπόδοσις','n3e'],['ἀνταπόδομα','n3c'],['τάραχος','n2a'],['ἐριθεία','n1a'],['ἀντίδικος','n2a'],['ἔχθρα','n1a'],['σχίσμα','n3c'],['διχοστασία','n1a'],['διαμερισμός','n2a'],['ἔρις','n3c'],['μάχη','n1b'],['μάχαιρα','n1c'],['πόλεμος','n2a'],['ἀγών','n3f'],['πάλη','n1b'],['ἐκδίκησις','n3e'],['στάσις','n3e'],['ἐπίστασις','n3e'],['ἀποστασία','n1a'],['ἀκαταστασία','n1a'],['ἀντιλογία','n1a'],['στασιαστής','n1f'],['παραπικρασμός','n2a'],['θόρυβος','n2a'],['ταραχή','n1b'],['σύγχυσις','n3e'],['συστροφή','n1b'],['διωγμός','n2a'],['διώκτης','n1f'],['ἐνέδρα','n1a'],['νίκη','n1b'],['νῖκος','n3d'],['καταλλαγή','n1b'],['μεσίτης','n1f'],['ἄφεσις','n3e'],['ἱλασμός','n2a'],['ἱλαστήριον','n2c'],['ἀγωγή','n1b'],['ἀναστροφή','n1b'],['κατάστημα','n3c'],['τρόπος','n2a'],['ὁδός','n2b'],['βίος','n2a'],['βίωσις','n3e'],['ἐργασία','n1a'],['ἐργάτης','n1f'],['ἔθος','n3d'],['ἦθος','n3d'],['συνήθεια','n1a'],['Ἰουδαϊσμός','n2a'],['ὁδός','n2b'],['κόσμος','n2a'],['αἰών','n3f'],['μιμητής','n1f'],['συμμιμητής','n1f'],['ἐπιστροφή','n1b'],['μετάνοια','n1a'],['ἐνέργεια','n1a'],['πρᾶξις','n3e'],['ποίησις','n3e'],['πρᾶξις','n3e'],['πρᾶγμα','n3c'],['ἕξις','n3e'],['ἔργον','n2c'],['ἐνέργημα','n3c'],['ἔργον','n2c'],['καρπός','n2a'],['στέφανος','n2a'],['ποιητής','n1f'],['τόπος','n2a'],['χρεία','n1a'],['ἀπόχρησις','n3e'],['οἰκονομία','n1a'],['δρόμος','n2a'],['ποίημα','n3c'],['οἰκοδομή','n1b'],['κτίσις','n3e'],['καταβολή','n1b'],['κτίσμα','n3c'],['κτίστης','n1f'],['κτίσμα','n3c'],['ἔργον','n2c'],['ἐργάτης','n1f'],['συνεργός','n2a'],['σύζυγος','n2a'],['κόπος','n2a'],['μόχθος','n2a'],['πόνος','n2a'],['τέχνη','n1b'],['τεχνίτης','n1f'],['γεωργός','n2a'],['θερισμός','n2a'],['καρπός','n2a'],['θερισμός','n2a'],['θεριστής','n1f'],['κηπουρός','n2a'],['ἀμπελουργός','n2a'],['ποιμήν','n3f'],['ἀρχιποίμην','n3f'],['ἁλιεύς','n3e'],['ἅλωσις','n3e'],['οἰκοδόμος','n2a'],['δημιουργός','n2a'],['τέκτων','n3f'],['ἀρχιτέκτων','n3f'],['οἰκονομία','n1a'],['οἰκονόμος','n2a'],['οἰκέτης','n1f'],['οἰκετεία','n1a'],['θεραπεία','n1a'],['ἀρχιτρίκλινος','n2a'],['θυρωρός','n2b'],['θυρωρός','n2a'],['διακονία','n1a'],['πρόσχυσις','n3e'],['ῥαντισμός','n2a'],['γναφεύς','n3e'],['περίθεσις','n3e'],['ἔνδυσις','n3e'],['καταστολή','n1b'],['ἀπέκδυσις','n3e'],['γυμνότης','n3c'],['ἐμπλοκή','n1b'],['πλέγμα','n3c'],['ἄθλησις','n3e'],['ἀγών','n3f'],['δρόμος','n2a'],['γυμνασία','n1a'],['ἑορτή','n1b'],['πανήγυρις','n3e'],['πάσχα','n3g'],['πεντηκοστή','n1b'],['ἐγκαίνια','n2c'],['σκηνοπηγία','n1a'],['νηστεία','n1a'],['γενέσια','n2c'],['νεομηνία','n1a'],['κοπετός','n2a'],['ὀδυρμός','n2a'],['ἐνταφιασμός','n2a'],['ταφή','n1b'],['θρησκεία','n1a'],['εὐσέβεια','n1a'],['θεοσέβεια','n1a'],['δεισιδαιμονία','n1a'],['δικαιοσύνη','n1b'],['εὐσέβεια','n1a'],['εὐλάβεια','n1a'],['ἀσέβεια','n1a'],['ἐθελοθρησκία','n1a'],['λειτουργία','n1a'],['λατρεία','n1a'],['προσφορά','n1a'],['ἀνάθημα','n3c'],['θυσία','n1a'],['σφάγιον','n2c'],['κορβᾶν','n3g'],['ἀπαρχή','n1b'],['ὁλοκαύτωμα','n3c'],['θυμίαμα','n3c'],['κορβᾶν','n3g'],['καθαρότης','n3c'],['καθαρισμός','n2a'],['ἁγνισμός','n2a'],['βαπτισμός','n2a'],['μολυσμός','n2a'],['ἀλίσγημα','n3c'],['βάπτισμα','n3c'],['βαπτισμός','n2a'],['βαπτιστής','n1f'],['λουτρόν','n2c'],['ἁγιασμός','n2a'],['ἁγιωσύνη','n1b'],['ὁσιότης','n3c'],['περιτομή','n1b'],['σέβασμα','n3c'],['προσκυνητής','n1f'],['φόβος','n2a'],['δέος','n3d'],['εἰδωλολατρία','n1a'],['εἰδωλολάτρης','n1f'],['νηστεία','n1a'],['διάκονος','n2b'],['ἐπισκοπή','n1b'],['ἐπίσκοπος','n2a'],['ποιμήν','n3f'],['ἀποστολή','n1b'],['ἀπόστολος','n2a'],['ψευδαπόστολος','n2a'],['εὐαγγελιστής','n1f'],['συμπρεσβύτερος','n2a'],['προφήτης','n1f'],['προφῆτις','n3c'],['ψευδοπροφήτης','n1f'],['Χριστός','n2a'],['Μεσσίας','n1d'],['ἀντίχριστος','n2a'],['ψευδόχριστος','n2a'],['ἱερατεία','n1a'],['ἱεράτευμα','n3c'],['ἱερωσύνη','n1b'],['ἱερεύς','n3e'],['ἀρχιερεύς','n3e'],['Λευίτης','n1f'],['ἀρχισυνάγωγος','n2a'],['γραμματεύς','n3e'],['νεωκόρος','n2a'],['μαγεία','n1a'],['μάγος','n2a'],['φαρμακεία','n1a'],['φάρμακον','n2c'],['φάρμακος','n2a'],['ἐξορκιστής','n1f'],['ἱερόσυλος','n2a'],['πλοῦς','n3e'],['κυβερνήτης','n1f'],['ναύκληρος','n2a'],['ναύτης','n1f'],['στρατεία','n1a'],['πόλεμος','n2a'],['μάχαιρα','n1c'],['ῥομφαία','n1a'],['στρατόπεδον','n2c'],['στράτευμα','n3c'],['λεγιών','n3f'],['σπεῖρα','n1c'],['στράτευμα','n3c'],['τετράδιον','n2c'],['πραιτώριον','n2c'],['κουστωδία','n1a'],['στρατοπέδαρχος','n2a'],['χιλίαρχος','n2a'],['κεντυρίων','n3f'],['ἑκατόνταρχος','n2a'],['ἑκατοντάρχης','n1f'],['στρατιώτης','n1f'],['ἱππεύς','n3e'],['δεξιολάβος','n2a'],['αἰχμαλωσία','n1a'],['αἰχμάλωτος','n2a'],['κριτήριον','n2c'],['κρίσις','n3e'],['ἡμέρα','n1a'],['πρᾶγμα','n3c'],['κριτήριον','n2c'],['κρίμα','n3c'],['αἰτία','n1a'],['αἰτίωμα','n3c'],['αἰτία','n1a'],['ἔγκλημα','n3c'],['λόγος','n2a'],['ἀντίδικος','n2a'],['ἀνάκρισις','n3e'],['διάγνωσις','n3e'],['κρίμα','n3c'],['κρίσις','n3e'],['ἀπόκριμα','n3c'],['δικαιοκρισία','n1a'],['κριτής','n1f'],['δικαστής','n1f'],['ἄρχων','n3c'],['κατάκρισις','n3e'],['κατάκριμα','n3c'],['καταδίκη','n1b'],['δικαίωσις','n3e'],['δικαίωμα','n3c'],['ἐκδίκησις','n3e'],['ῥήτωρ','n3f'],['κατάσχεσις','n3e'],['συγκοινωνός','n2a'],['κτήτωρ','n3f'],['κύριος','n2a'],['δεσπότης','n1f'],['οἰκοδεσπότης','n1f'],['κτῆμα','n3c'],['ὕπαρξις','n3e'],['βίος','n2a'],['οὐσία','n1a'],['σκεῦος','n3d'],['οἰκία','n1a'],['οἶκος','n2a'],['πλοῦτος','n2a'],['χρῆμα','n3c'],['εὐπορία','n1a'],['μαμωνᾶς','n1e'],['τιμιότης','n1f'],['γάζα','n1c'],['ὑστέρησις','n3e'],['ὑστέρημα','n3c'],['χρεία','n1a'],['πένης','n3c'],['πτωχεία','n1a'],['κατάσχεσις','n3e'],['περιποίησις','n3e'],['κλείς','n3c'],['λογεία','n1a'],['ζημία','n1a'],['δόσις','n3e'],['δότης','n1f'],['δόμα','n3c'],['δώρημα','n3c'],['δωρεά','n1a'],['δῶρον','n2c'],['δωροφορία','n1a'],['κλῆρος','n2a'],['μερισμός','n2a'],['διαίρεσις','n3e'],['κοινωνία','n1a'],['κοινωνία','n1a'],['χάρις','n3c'],['χάρισμα','n3c'],['εὐλογία','n1a'],['ἁπλότης','n3c'],['ἀγαθωσύνη','n1b'],['δικαιοσύνη','n1b'],['ἐλεημοσύνη','n1b'],['ὀψώνιον','n2c'],['διακονία','n1a'],['βραβεῖον','n2c'],['στέφανος','n2a'],['διαθήκη','n1b'],['λῆμψις','n3e'],['μετάλημψις','n3e'],['κληρονομία','n1a'],['κληρονόμος','n2a'],['ἀντάλλαγμα','n3c'],['ἀνταπόδομα','n3c'],['δαπάνη','n1b'],['τιμή','n1b'],['κεφάλαιον','n2c'],['ὀψώνιον','n2c'],['ἀμοιβή','n1b'],['ἀρραβών','n3f'],['ἀπαρχή','n1b'],['μισθός','n2a'],['μίσθιος','n2a'],['μισθωτός','n2a'],['μίσθωμα','n3c'],['τέλος','n3d'],['κῆνσος','n2a'],['δίδραχμον','n2c'],['φόρος','n2a'],['τελώνιον','n2c'],['τελώνης','n1f'],['ἀρχιτελώνης','n1f'],['ἀνδραποδιστής','n1f'],['κέρδος','n3d'],['ἐργασία','n1a'],['πορισμός','n2a'],['ἐμπορία','n1a'],['ἐργασία','n1a'],['μέρος','n3d'],['πορεία','n1a'],['εὐπορία','n1a'],['ἔμπορος','n2a'],['πορφυρόπωλις','n3c'],['κολλυβιστής','n1f'],['κερματιστής','n1f'],['ἐμπόριον','n2c'],['ἀγορά','n1a'],['μάκελλον','n2c'],['δάνειον','n2c'],['δανιστής','n1f'],['τόκος','n2a'],['τράπεζα','n1c'],['τραπεζίτης','n1f'],['ὀφειλή','n1b'],['ὀφείλημα','n3c'],['ὀφειλέτης','n1f'],['λόγος','n2a'],['κλέμμα','n3c'],['κλοπή','n1b'],['κλέπτης','n1f'],['ἁρπαγμός','n2a'],['ἁρπαγή','n1b'],['λῃστής','n1f'],['ἱερόσυλος','n2a'],['ἀκροθίνιον','n2c'],['ὑπόστασις','n3e'],['μορφή','n1b'],['μόρφωσις','n3e'],['σχῆμα','n3c'],['φύσις','n3e'],['σάρξ','n3b'],['πλάσμα','n3c'],['σπέρμα','n3c'],['εἶδος','n3d'],['εἰδέα','n1a'],['μορφή','n1b'],['σχῆμα','n3c'],['ἀρχή','n1b'],['τάξις','n3e'],['ὄνομα','n3c'],['γένος','n3d'],['φύσις','n3e'],['τύπος','n2a'],['υἱός','n2a'],['γέννημα','n3c'],['τέκνον','n2c'],['ἰσότης','n3c'],['εἰκών','n3f'],['διαίρεσις','n3e'],['διαστολή','n1b'],['παραλλαγή','n1b'],['τύπος','n2a'],['ὑποτύπωσις','n3e'],['ὑπογραμμός','n2a'],['ὑπόδειγμα','n3c'],['εἰκών','n3f'],['χαρακτήρ','n3f'],['τύπος','n2a'],['παραβολή','n1b'],['πατήρ','n3f'],['μήτηρ','n3f'],['σκιά','n1a'],['σῶμα','n3c'],['καινότης','n3c'],['ἀνακαίνωσις','n3e'],['παλαιότης','n3c'],['πλῆθος','n3d'],['πλήρωμα','n3c'],['πλήρωμα','n3c'],['περίσσευμα','n3c'],['περισσεία','n1a'],['κόσμος','n2a'],['ἁδρότης','n3c'],['ἀριθμός','n2a'],['μυριάς','n3c'],['ζεῦγος','n3d'],['χιλιάς','n3c'],['τάξις','n3e'],['τροχός','n2a'],['ἄλφα','n3g'],['ἀπαρχή','n1b'],['διάδοχος','n2a'],['πέρας','n3c'],['τάγμα','n3c'],['διόρθωσις','n3e'],['ἑνότης','n3c'],['σύνδεσμος','n2a'],['μίγμα','n3c'],['φύραμα','n3c'],['μερίς','n3c'],['μέρος','n3d'],['μέλος','n3d'],['κλῆρος','n2a'],['λεῖμμα','n3c'],['ὑπόλειμμα','n3c'],['μερισμός','n2a'],['μεριστής','n1f'],['αἵρεσις','n3e'],['ὁμοιότης','n3c'],['ὁμοίωμα','n3c'],['ὁμοίωσις','n3e'],['τιμή','n1b'],['πιότης','n3c'],['θησαυρός','n2a'],['δοκιμή','n1b'],['ἀπώλεια','n1a'],['ματαιότης','n3c'],['ὄφελος','n3d'],['ὠφέλεια','n1a'],['ἀναίδεια','n1a'],['καιρός','n2a'],['χρόνος','n2a'],['ὥρα','n1a'],['προθεσμία','n1a'],['εὐκαιρία','n1a'],['ἀρχή','n1b'],['τέλος','n3d'],['συντέλεια','n1a'],['ἔκβασις','n3e'],['πλήρωμα','n3c'],['ἐκπλήρωσις','n3e'],['αὐγή','n1b'],['ὄρθρος','n2a'],['μεσημβρία','n1a'],['μεσονύκτιον','n2c'],['χρόνος','n2a'],['καιρός','n2a'],['τροχός','n2a'],['παλαιότης','n3c'],['καινότης','n3c'],['τάχος','n3d'],['βραδύτης','n3c'],['ἀναβολή','n1b'],['ἡμέρα','n1a'],['αἰών','n3f'],['γενεά','n1a'],['καιρός','n2a'],['ἐνιαυτός','n2a'],['παλιγγενεσία','n1a'],['ὥρα','n1a'],['στιγμή','n1b'],['διάστημα','n3c'],['ἡλικία','n1a'],['βρέφος','n3d'],['νεότης','n3c'],['ἡλικία','n1a'],['γῆρας','n3d'],['συνηλικιώτης','n1f'],['θέρος','n3d'],['παραχειμασία','n1a'],['ἔτος','n3d'],['ἐνιαυτός','n2a'],['διετία','n1a'],['τριετία','n1a'],['μήν','n3f'],['σάββατον','n2c'],['ἡμέρα','n1a'],['νυχθήμερον','n2c'],['σάββατον','n2c'],['σαββατισμός','n2a'],['ὄρθρος','n2a'],['ἑσπέρα','n1a'],['νύξ','n3c'],['φυλακή','n1b'],['ὀψία','n1a'],['ἀλεκτοροφωνία','n1a'],['ὥρα','n1a'],['ἡμίωρον','n2c'],['παρασκευή','n1b'],['προσάββατον','n2c'],['ἀρχή','n1b'],['ἀρχηγός','n2a'],['ἐπεισαγωγή','n1b'],['τελειωτής','n1f'],['ἀπαρτισμός','n2a'],['ἀνάπαυσις','n3e'],['ὑποστολή','n1b'],['ἀφθαρσία','n1a'],['σπουδή','n1b'],['προσκαρτέρησις','n3e'],['σπουδή','n1b'],['ὅρμημα','n3c'],['τόπος','n2a'],['ἀδηλότης','n3c'],['χρεία','n1a'],['ὀφειλή','n1b'],['ὀφείλημα','n3c'],['ὀφειλέτης','n1f'],['ἀνάγκη','n1b'],['ἀνάγκη','n1b'],['ἀλήθεια','n1a'],['φωτισμός','n2a'],['δοκιμή','n1b'],['ἔλεγχος','n2a'],['ἐπανόρθωσις','n3e'],['διόρθωμα','n3c'],['ἀκρίβεια','n1a'],['δοκίμιον','n2c'],['σφραγίς','n3c'],['δύναμις','n3e'],['ἰσχύς','n3e'],['ἄθλησις','n3e'],['οἰκοδομή','n1b'],['καθαίρεσις','n3e'],['στερέωμα','n3c'],['στηριγμός','n2a'],['ἀσθένεια','n1a'],['ἀσθένημα','n3c'],['ἱκανότης','n3c'],['κατάρτισις','n3e'],['καταρτισμός','n2a'],['αὐτάρκεια','n1a'],['δύναμις','n3e'],['μεγαλειότης','n3c'],['χείρ','n3f'],['κράτος','n3d'],['δύναμις','n3e'],['ἐξουσία','n1a'],['δόξα','n1c'],['ἀρετή','n1b'],['κέρας','n3c'],['ἀθέτησις','n3e'],['ἑτοιμασία','n1a'],['μέγεθος','n3d'],['βάθος','n3d'],['ἀνάχυσις','n3e'],['περισσεία','n1a'],['ὑπερβολή','n1b'],['πύρωσις','n3e'],['τέλος','n3d'],['μέρος','n3d'],['ὅρος','n2a'],['κόσμος','n2a'],['εὐπρέπεια','n1a'],['εὐσχημοσύνη','n1b'],['δόξα','n1c'],['πικρία','n1a'],['ἄψινθος','n2b'],['ὀσμή','n1b'],['εὐωδία','n1a'],['περικάθαρμα','n3c'],['περίψημα','n3c'],['ἀκαθαρσία','n1a'],['ῥύπος','n2a'],['σπίλος','n2a'],['σπιλάς','n3c'],['μῶμος','n2a'],['ἰσχύς','n3e'],['θέρμη','n1b'],['ψῦχος','n3d'],['φύραμα','n3c'],['πρόσωπον','n2c'],['ἄκρον','n2c'],['κέρας','n3c'],['ἀρχή','n1b'],['γωνία','n1a'],['μέρος','n3d'],['στόμα','n3c'],['ἕλιγμα','n3c'],['τόπος','n2a'],['κανών','n3f'],['ὁροθεσία','n1a'],['πέρας','n3c'],['ἄκρον','n2c'],['μέτρον','n2c'],['ὕψος','n3d'],['ἡλικία','n1a'],['βάθος','n3d'],['μῆκος','n3d'],['πλάτος','n3d'],['βάτος','n2b'],['κόρος','n2a'],['μετρητής','n1f'],['σάτον','n2c'],['χοῖνιξ','n3b'],['πῆχυς','n3e'],['ὀργυιά','n1a'],['μίλιον','n2c'],['ἀνατολή','n1b'],['δύσις','n3e'],['δυσμή','n1b'],['βορρᾶς','n1e'],['βορρᾶς','n1h'],['νότος','n2a'],['μεσημβρία','n1a'],['χῶρος','n2a'],['λίψ','n3a'],['καρδία','n1a'],['πρόσωπον','n2c'],['νομή','n1b'],['σκοπός','n2a'],['παρουσία','n1a'],['πρόσωπον','n2c'],['ἀπουσία','n1a'],['ὑστέρημα','n3c'],['ἐπίθεσις','n3e'],['οἰκητήριον','n2c'],['κατοικία','n1a'],['κατοίκησις','n3e'],['κατοικητήριον','n2c'],['μονή','n1b'],['σκήνωμα','n3c'],['παροικία','n1a'],['μετοικεσία','n1a'],['φυλακή','n1b'],['λίτρα','n1a'],['τόπος','n2a'],['κλῆσις','n3e'],['βαθμός','n2a'],['τιμή','n1b'],['δόξα','n1c'],['κλέος','n3d'],['πρωτοκλισία','n1a'],['πρωτοκαθεδρία','n1a'],['ὕψος','n3d'],['ἐξοχή','n1b'],['μεγαλωσύνη','n1b'],['μεγαλειότης','n3c'],['δόξα','n1c'],['ὑπεροχή','n1b'],['ἀνάστασις','n3e'],['μεγιστάν','n3f'],['πατήρ','n3f'],['ἐπιστάτης','n1f'],['κεφαλή','n1b'],['πρωτοστάτης','n1f'],['κύριος','n2a'],['κυρία','n1a'],['φαντασία','n1a'],['ταπείνωσις','n3e'],['ὄχλος','n2a'],['λαός','n2a'],['ἀτιμία','n1a'],['ὄνειδος','n3d'],['πτῶσις','n3e'],['δοῦλος','n2a'],['παῖς','n3c'],['σῶμα','n3c'],['σύνδουλος','n2a'],['δούλη','n1b'],['παιδίσκη','n1b'],['ἀπελεύθερος','n2a'],['Λιβερτῖνος','n2a'],['ἀγαθωσύνη','n1b'],['εὐεργεσία','n1a'],['χρηστότης','n3c'],['ἀρετή','n1b'],['δικαιοσύνη','n1b'],['δικαίωμα','n3c'],['εὐθύτης','n3c'],['ἀδικία','n1a'],['ἀδίκημα','n3c'],['ἁγιωσύνη','n1b'],['ἁγιότης','n3c'],['ὁσιότης','n3c'],['ἁγνεία','n1a'],['ἁγνότης','n3c'],['τελειότης','n3c'],['τελείωσις','n3e'],['εἰλικρίνεια','n1a'],['ἀφθορία','n1a'],['ἁπλότης','n3c'],['σεμνότης','n3c'],['αἰδώς','n3d'],['ταπείνωσις','n3e'],['ταπεινοφροσύνη','n1b'],['ἀφελότης','n3c'],['πραΰτης','n3c'],['ἐπιείκεια','n1a'],['χάρις','n3c'],['χρηστότης','n3c'],['εὐλογία','n1a'],['φιλανθρωπία','n1a'],['ἀποτομία','n1a'],['ἔλεος','n3d'],['οἰκτιρμός','n2a'],['ἐγκράτεια','n1a'],['ἀφειδία','n1a'],['ἀκρασία','n1a'],['σωφρονισμός','n2a'],['σωφροσύνη','n1b'],['ἀσωτία','n1a'],['ἐλαφρία','n1a'],['τελειότης','n3c'],['ἡσυχία','n1a'],['κακία','n1a'],['πονηρία','n1a'],['κακοήθεια','n1a'],['ἁμαρτία','n1a'],['θηρίον','n2c'],['ἀλώπηξ','n3b'],['λύκος','n2a'],['κύων','n3f'],['ἔχιδνα','n1c'],['ὄφις','n3e'],['σκότος','n3d'],['σκοτία','n1a'],['ὕβρις','n3e'],['ὑβριστής','n1f'],['πλήκτης','n1f'],['ἀνομία','n1a'],['παρανομία','n1a'],['πλεονεξία','n1a'],['ἀσχημοσύνη','n1b'],['αἰσχύνη','n1b'],['αἰσχρότης','n3c'],['δόλος','n2a'],['κυβεία','n1a'],['μεθοδεία','n1a'],['φθόνος','n2a'],['ζῆλος','n3d'],['ἐριθεία','n1a'],['ὀργή','n1b'],['παροργισμός','n2a'],['θυμός','n2a'],['ἄνοια','n1a'],['ἀγανάκτησις','n3e'],['καταφρονητής','n1f'],['κακία','n1a'],['πικρία','n1a'],['ὕψωμα','n3c'],['ὑπερηφανία','n1a'],['φυσίωσις','n3e'],['ἀλαζονεία','n1a'],['ἀλαζών','n3f'],['κενοδοξία','n1a'],['σκληρότης','n3c'],['σκληροκαρδία','n1a'],['ὑπόκρισις','n3e'],['ὑποκριτής','n1f'],['πρόφασις','n3e'],['γόης','n3c'],['ζύμη','n1b'],['προσωπολημψία','n1a'],['προσωπολήμπτης','n1f'],['πρόσκλισις','n3e'],['ἀλλοτριεπίσκοπος','n2a'],['τρυφή','n1b'],['στρῆνος','n3d'],['ῥυπαρία','n1a'],['μίασμα','n3c'],['μιασμός','n2a'],['ἀκαθαρσία','n1a'],['πλάνη','n1b'],['φθορά','n1a'],['πανουργία','n1a'],['πορνεία','n1a'],['ἀσέλγεια','n1a'],['κοίτη','n1b'],['πόρνος','n2a'],['πόρνη','n1b'],['μοιχεία','n1a'],['μοιχός','n2a'],['μοιχαλίς','n3c'],['ἀρσενοκοίτης','n1f'],['κύων','n3f'],['μέθη','n1b'],['οἰνοφλυγία','n1a'],['κραιπάλη','n1b'],['κῶμος','n2a'],['πότος','n2a'],['μέθυσος','n2a'],['οἰνοπότης','n1f'],['ἁμαρτία','n1a'],['ἁμάρτημα','n3c'],['παράπτωμα','n3c'],['ὀφείλημα','n3c'],['ὀφειλέτης','n1f'],['ῥᾳδιουργία','n1a'],['ῥᾳδιούργημα','n3c'],['ἀγνόημα','n3c'],['σκάνδαλον','n2c'],['πρόσκομμα','n3c'],['προσκοπή','n1b'],['πειρασμός','n2a'],['ἁμαρτία','n1a'],['αἰτία','n1a'],['ἀναλογία','n1a'],['θεμέλιον','n2c'],['αἰτία','n1a'],['ἀρχή','n1b'],['ῥίζα','n1c'],['λόγος','n2a'],['ἀφορμή','n1b'],['ἔκβασις','n3e'],['τέλος','n3d'],['ὀψώνιον','n2c'],['τέλος','n3d'],['τρόπος','n2a'],['τύπος','n2a'],['παροξυσμός','n2a'],['περιποίησις','n3e'],['δεῖνα','n3f'],['Ἀαρών','n3g'],['Ἀβαδδών','n3g'],['Ἅβελ','n3g'],['Ἀβιά','n3g'],['Ἀβιαθάρ','n3g'],['Ἀβιούδ','n3g'],['Ἀβραάμ','n3g'],['Ἅγαβος','n2a'],['Ἀγρίππας','n1e'],['Ἀδάμ','n3g'],['Ἀδδί','n3g'],['Ἀδμίν','n3g'],['Ἀζώρ','n3g'],['Αἰνέας','n1d'],['Ἀκύλας','n3g'],['Ἀλέξανδρος','n2a'],['Ἀμιναδάβ','n3g'],['Ἀμπλιᾶτος','n2a'],['Ἀμών','n3g'],['Ἀμώς','n3g'],['Ἀνδρέας','n1d'],['Ἀνδρόνικος','n2a'],['Ἅννα','n1a'],['Ἅννας','n1e'],['Ἀντιπᾶς','n1e'],['Ἀπελλῆς','n1h'],['Ἀπολλύων','n3f'],['Ἀπολλῶς','n2e'],['Ἀπφία','n1a'],['Ἀράμ','n3g'],['Ἀρίσταρχος','n2a'],['Ἀριστόβουλος','n2a'],['Ἀρνί','n3g'],['Ἀρτεμᾶς','n1e'],['Ἄρτεμις','n3c'],['Ἀρφαξάδ','n3g'],['Ἀρχέλαος','n2a'],['Ἄρχιππος','n2a'],['Ἀσά','n3g'],['Ἀσάφ','n3g'],['Ἀσήρ','n3g'],['Ἀσύγκριτος','n2a'],['Αὐγοῦστος','n2a'],['Ἀχάζ','n3g'],['Ἀχαϊκός','n2a'],['Ἀχίμ','n3g'],['Βάαλ','n3g'],['Βαλαάμ','n3g'],['Βαλάκ','n3g'],['Βαραββᾶς','n1e'],['Βαράκ','n3g'],['Βαραχίας','n1d'],['Βαρθολομαῖος','n2a'],['Βαριησοῦς','n3g'],['Βαριωνᾶ','n3g'],['Βαριωνᾶς','n1e'],['Βαρναβᾶς','n1e'],['Βαρτιμαῖος','n2a'],['Βελιάρ','n3g'],['Βενιαμίν','n3g'],['Βερνίκη','n1b'],['Βεώρ','n3g'],['Βλάστος','n2a'],['Βοανηργές','n3g'],['Βόες','n3g'],['Βόος','n3g'],['Βοσόρ','n3g'],['Γαβριήλ','n3g'],['Γάδ','n3g'],['Γάϊος','n2a'],['Γαλλίων','n3f'],['Γαμαλιήλ','n3g'],['Γεδεών','n3g'],['Γώγ','n3g'],['Δάμαρις','n3c'],['Δανιήλ','n3g'],['Δαυίδ','n3g'],['Δημᾶς','n1e'],['Δημήτριος','n2a'],['Δίδυμος','n2a'],['Διονύσιος','n2a'],['Διόσκουροι','n2a'],['Διοτρέφης','n3d'],['Δορκάς','n3c'],['Δρούσιλλα','n1c'],['Ἔβερ','n3g'],['Ἐλεάζαρ','n3g'],['Ἐλιακίμ','n3g'],['Ἐλιέζερ','n3g'],['Ἐλιούδ','n3g'],['Ἐλισάβετ','n3g'],['Ἐλισαῖος','n2a'],['Ἐλμαδάμ','n3g'],['Ἐλύμας','n1e'],['Ἐμμανουήλ','n3g'],['Ἐνώς','n3g'],['Ἐπαίνετος','n2a'],['Ἐπαφρᾶς','n1e'],['Ἐπαφρόδιτος','n2a'],['Ἔραστος','n2a'],['Εὕα','n1a'],['Εὔβουλος','n2a'],['Εὐνίκη','n1b'],['Εὐοδία','n1a'],['Εὔτυχος','n2a'],['Ζαβουλών','n3g'],['Ζακχαῖος','n2a'],['Ζάρα','n3g'],['Ζαχαρίας','n1d'],['Ζεβεδαῖος','n2a'],['Ζεύς','n3g'],['Ζηνᾶς','n3g'],['Ζοροβαβέλ','n3g'],['Ἠλί','n3g'],['Ἠλίας','n1d'],['Ἤρ','n3g'],['Ἠσαῦ','n3g'],['Θαδδαῖος','n2a'],['Θαμάρ','n3g'],['Θάρα','n3g'],['Θεόφιλος','n2a'],['Θευδᾶς','n1e'],['Θωμᾶς','n1e'],['Ἰάϊρος','n2a'],['Ἰακώβ','n3g'],['Ἰάκωβος','n2a'],['Ἰαμβρῆς','n1f'],['Ἰανναί','n3g'],['Ἰάννης','n1f'],['Ἰάρετ','n3g'],['Ἰάσων','n3f'],['Ἰερεμίας','n1d'],['Ἰεσσαί','n3g'],['Ἰεφθάε','n3g'],['Ἰεχονίας','n1d'],['Ἰησοῦς','n3g'],['Ἰουδαία','n1a'],['Ἰούδας','n1e'],['Ἰούδας','n1e'],['Ἰουλία','n1a'],['Ἰούλιος','n2a'],['Ἰουνιᾶς','n1e'],['Ἰοῦστος','n2a'],['Ἰσαάκ','n3g'],['Ἰσκαριώθ','n3g'],['Ἰσραήλ','n3g'],['Ἰσραηλίτης','n1f'],['Ἰσσαχάρ','n3g'],['Ἰωαθάμ','n3g'],['Ἰωανάν','n3g'],['Ἰωάννα','n1a'],['Ἰωάννης','n1f'],['Ἰώβ','n3g'],['Ἰωβήδ','n3g'],['Ἰωδά','n3g'],['Ἰωήλ','n3g'],['Ἰωνάθας','n1d'],['Ἰωνάμ','n3g'],['Ἰωνᾶς','n1e'],['Ἰωράμ','n3g'],['Ἰωρίμ','n3g'],['Ἰωσαφάτ','n3g'],['Ἰωσῆς','n3c'],['Ἰωσῆς','n1g'],['Ἰωσήφ','n3g'],['Ἰωσήχ','n3g'],['Ἰωσίας','n1d'],['Καϊάφας','n1e'],['Κάϊν','n3g'],['Καϊνάμ','n3g'],['Καῖσαρ','n3f'],['Κανδάκη','n1b'],['Κάρπος','n2a'],['Κηφᾶς','n1e'],['Κίς','n3g'],['Κλαυδία','n1a'],['Κλαύδιος','n2a'],['Κλεοπᾶς','n1e'],['Κλήμης','n3c'],['Κλωπᾶς','n1e'],['Κόρε','n3g'],['Κορνήλιος','n2a'],['Κούαρτος','n2a'],['Κρήσκης','n3c'],['Κρίσπος','n2a'],['Κυρήνιος','n2a'],['Κωσάμ','n3g'],['Λάζαρος','n2a'],['Λάμεχ','n3g'],['Λεββαῖος','n2a'],['Λευί','n3g'],['Λευίς','n3g'],['Λίνος','n2a'],['Λουκᾶς','n1e'],['Λούκιος','n2a'],['Λυδία','n1a'],['Λυσανίας','n1d'],['Λυσίας','n1d'],['Λώτ','n3g'],['Μάαθ','n3g'],['Μαγδαληνή','n1b'],['Μαγώγ','n3g'],['Μαθθαῖος','n2a'],['Ματθαῖος','n2a'],['Μαθθάτ','n3g'],['Ματθάτ','n3g'],['Μαθθίας','n1d'],['Ματθίας','n1d'],['Μαλελεήλ','n3g'],['Μάλχος','n2a'],['Μαναήν','n3g'],['Μανασσῆς','n1g'],['Μάρθα','n1a'],['Μαρία','n1a'],['Μαριάμ','n3g'],['Μᾶρκος','n2a'],['Ματθάν','n3g'],['Ματταθά','n3g'],['Ματταθίας','n1d'],['Μελεά','n3g'],['Μελχί','n3g'],['Μελχισέδεκ','n3g'],['Μεννά','n3g'],['Μιχαήλ','n3g'],['Μνάσων','n3f'],['Μολόχ','n3g'],['Μωϋσῆς','n3g'],['Ναασσών','n3g'],['Ναγγαί','n3g'],['Ναθάμ','n3g'],['Ναθαναήλ','n3g'],['Ναιμάν','n3g'],['Ναούμ','n3g'],['Νάρκισσος','n2a'],['Ναχώρ','n3g'],['Νεφθαλίμ','n3g'],['Νηρεύς','n3e'],['Νηρί','n3g'],['Νίγερ','n3g'],['Νικάνωρ','n3f'],['Νικόδημος','n2a'],['Νικόλαος','n2a'],['Νύμφα','n1a'],['Νυμφᾶς','n1e'],['Νῶε','n3g'],['Ὀζίας','n1d'],['Ὀλυμπᾶς','n1e'],['Ὀνήσιμος','n2a'],['Ὀνησίφορος','n2a'],['Οὐρβανός','n2a'],['Οὐρίας','n1d'],['Παρμενᾶς','n1e'],['Πατροβᾶς','n1e'],['Παῦλος','n2a'],['Περσίς','n3c'],['Πέτρος','n2a'],['Πιλᾶτος','n2a'],['Πόντιος','n2a'],['Πόπλιος','n2a'],['Πόρκιος','n2a'],['Πούδης','n3c'],['Πρίσκα','n1c'],['Πρίσκιλλα','n1c'],['Πρόχορος','n2a'],['Πύρρος','n2a'],['Σαδώκ','n3g'],['Σαλά','n3g'],['Σαλαθιήλ','n3g'],['Σαλήμ','n3g'],['Σαλμών','n3g'],['Σαλώμη','n1b'],['Σαμουήλ','n3g'],['Σαμψών','n3g'],['Σαούλ','n3g'],['Σάπφιρα','n1c'],['Σάρρα','n1a'],['Σατανᾶς','n1e'],['Σαῦλος','n2a'],['Σεκοῦνδος','n2a'],['Σέργιος','n2a'],['Σερούχ','n3g'],['Σήθ','n3g'],['Σήμ','n3g'],['Σιλουανός','n2a'],['Σίμων','n3f'],['Σκευᾶς','n1e'],['Σουσάννα','n1c'],['Στάχυς','n3e'],['Στεφανᾶς','n1e'],['Στέφανος','n2a'],['Συμεών','n3g'],['Συντύχη','n1b'],['Συχέμ','n3g'],['Σώπατρος','n2a'],['Σωσθένης','n3d'],['Σωσίπατρος','n2a'],['Ταβιθά','n3g'],['Τέρτιος','n2a'],['Τέρτυλλος','n2a'],['Τιβέριος','n2a'],['Τιμαῖος','n2a'],['Τιμόθεος','n2a'],['Τίμων','n3f'],['Τίτιος','n2a'],['Τίτος','n2a'],['Τρόφιμος','n2a'],['Τρύφαινα','n1c'],['Τρυφῶσα','n1c'],['Τύραννος','n2a'],['Φάλεκ','n3g'],['Φανουήλ','n3g'],['Φαραώ','n3g'],['Φῆλιξ','n3b'],['Φῆστος','n2a'],['Φιλήμων','n3f'],['Φίλητος','n2a'],['Φίλιππος','n2a'],['Φιλόλογος','n2a'],['Φοίβη','n1b'],['Φορτουνᾶτος','n2a'],['Φύγελος','n2a'],['Χριστός','n2a'],['Ἀβιληνή','n1b'],['Ἀδρίας','n1d'],['Ἄζωτος','n2b'],['Ἀθῆναι','n1c'],['Αἴγυπτος','n2b'],['Αἰθίοψ','n3a'],['Αἰνών','n3g'],['Ἀλεξανδρεύς','n3e'],['Ἀμφίπολις','n3e'],['Ἀντιόχεια','n1a'],['Ἀντιοχεύς','n3e'],['Ἀντιπατρίς','n3c'],['Ἀπολλωνία','n1a'],['Ἀραβία','n1a'],['Ἄραψ','n3a'],['Ἀσία','n1a'],['Ἀσιανός','n2a'],['Ἆσσος','n2b'],['Ἀττάλεια','n1a'],['Βαβυλών','n3f'],['Βέροια','n1a'],['Βηθαβαρά','n1a'],['Βηθανία','n1a'],['Βηθεσδά','n3g'],['Βηθζαθά','n3g'],['Βηθλέεμ','n3g'],['Βηθσαϊδά','n3g'],['Βηθφαγή','n3g'],['Βιθυνία','n1a'],['Γάζα','n1c'],['Γαλάτης','n1f'],['Γαλατία','n1a'],['Γαλιλαία','n1a'],['Γαλλία','n1a'],['Γεθσημανί','n3g'],['Γεννησαρέτ','n3g'],['Γολγοθᾶ','n3g'],['Γόμορρα','n1a'],['Γόμορρα','n2c'],['Δαλμανουθά','n3g'],['Δαλματία','n1a'],['Δαμασκός','n2b'],['Δεκάπολις','n3e'],['Δέρβη','n1b'],['Ἐλαμίτης','n1f'],['Ἐμμαοῦς','n3g'],['Εὐφράτης','n1f'],['Ἔφεσος','n2b'],['Ἐφραίμ','n3g'],['Ζαβουλών','n3g'],['Θεσσαλονικεύς','n3e'],['Θεσσαλονίκη','n1b'],['Θυάτειρα','n3g'],['Θυάτιρα','n3g'],['Ἰδουμαία','n1a'],['Ἰεριχώ','n3g'],['Ἰερουσαλήμ','n3g'],['Ἰκόνιον','n2c'],['Ἰλλυρικόν','n2c'],['Ἰόππη','n1b'],['Ἰορδάνης','n1f'],['Ἰουδαία','n1a'],['Ἰούδας','n1e'],['Ἰταλία','n1a'],['Καισάρεια','n1a'],['Κανά','n3g'],['Καππαδοκία','n1a'],['Καῦδα','n3g'],['Καφαρναούμ','n3g'],['Κεγχρεαί','n1a'],['Κεδρών','n3g'],['Κιλικία','n1a'],['Κλαῦδα','n3g'],['Κνίδος','n2b'],['Κολοσσαί','n1b'],['Κορίνθιος','n2a'],['Κόρινθος','n2b'],['Κρής','n3c'],['Κρήτη','n1b'],['Κύπριος','n2a'],['Κύπρος','n2b'],['Κυρηναῖος','n2a'],['Κυρήνη','n1b'],['Κώς','n2e'],['Λαοδίκεια','n1a'],['Λαοδικεύς','n3e'],['Λασαία','n1a'],['Λιβύη','n1b'],['Λύδδα','n3g'],['Λυκαονία','n1a'],['Λυκία','n1a'],['Λύστρα','n3g'],['Μαγαδάν','n3g'],['Μαγδαλά','n3g'],['Μαδιάμ','n3g'],['Μακεδονία','n1a'],['Μακεδών','n3f'],['Μελίτη','n1b'],['Μεσοποταμία','n1a'],['Μῆδος','n2a'],['Μίλητος','n2b'],['Μιτυλήνη','n1b'],['Μύρα','n2c'],['Μυσία','n1a'],['Ναζαρά','n3g'],['Ναζαρέθ','n3g'],['Ναζαρέτ','n3g'],['Ναζωραῖος','n2a'],['Νεφθαλίμ','n3g'],['Νικόπολις','n3e'],['Νινευίτης','n1f'],['Παμφυλία','n1a'],['Πάταρα','n2c'],['Πάτμος','n2a'],['Πάφος','n2b'],['Πέργαμος','n2b'],['Πέργαμον','n2c'],['Πέργη','n1b'],['Πισιδία','n1a'],['Πόντος','n2a'],['Ποτίολοι','n2a'],['Σαλαμίς','n3f'],['Σαλίμ','n3g'],['Σαλήμ','n3g'],['Σαλμώνη','n1b'],['Σαμάρεια','n1a'],['Σαμαρίτης','n1f'],['Σαμοθρᾴκη','n1b'],['Σάμος','n2b'],['Σάρδεις','n3e'],['Σάρεπτα','n2c'],['Σαρών','n3f'],['Σελεύκεια','n1a'],['Σιδών','n3f'],['Σιλωάμ','n3g'],['Σιών','n3g'],['Σκύθης','n1f'],['Σμύρνα','n1c'],['Σόδομα','n2c'],['Σπανία','n1a'],['Συράκουσαι','n1c'],['Συρία','n1a'],['Σύρος','n2a'],['Συροφοινίκισσα','n1c'],['Σύρτις','n3e'],['Συχάρ','n3g'],['Συχέμ','n3g'],['Ταρσεύς','n3e'],['Ταρσός','n2b'],['Τιβεριάς','n3c'],['Τραχωνῖτις','n3c'],['Τρῳάς','n3c'],['Τρωγύλλιον','n2c'],['Τύριος','n2a'],['Τύρος','n2b'],['Φιλαδέλφεια','n1a'],['Φιλιππήσιος','n2a'],['Φίλιπποι','n2a'],['Φοινίκη','n1b'],['Φοῖνιξ','n3b'],['Φρυγία','n1a'],['Χαλδαῖος','n2a'],['Χανάαν','n3g'],['Χοραζίν','n3g']]:
#     w = generateNounForms(word[0],word[1])
#     for n in [1,2]:
#         if n == 1:
#             for c in [1,2,3,4,5]:
#                 s += 'word='+str(word[0]+word[1])+',n='+str(n)+',c='+str(c)+str(w[(c-1)+(n-1)*5] if isinstance(w,list) else w)+'\n'
#         else:
#             for c in [1,2,3,4]:
#                 s += 'word='+str(word[0]+word[1])+',n='+str(n)+',c='+str(c)+str(w[(c-1)+(n-1)*5] if isinstance(w,list) else w)+'\n'
# f = open('test','r+')
# f.write(s)
# f.close()